{"pages":[{"title":"关于我","text":"教育经历 硕士研究生上海师范大学 影视传媒学院广播电视专业研究方向：摄影2017年入学 工学学士上海第二工业大学 工学部软件工程专业2013年入学 研究方向 艺术批评 艺术科技融合探究 专业技能 风光摄影《Years Lapse to seconds》延时摄影 数据库管理维护 近期荣誉 上海师范大学优秀学生2018年度 甲骨文认证数据库专家Oracle Database 11g Administrator Certified Professional 全国大学生广告艺术大赛上海赛区三等奖2018年 第十届 联系我&nbsp;&nbsp;&nbsp;&nbsp;QQ: 508866652&nbsp;&nbsp;&nbsp;&nbsp;Email: w@cmwgallery.com / haohaiwang@foxmail.com","link":"/about/index.html"}],"posts":[{"title":"Linux","text":"运维实习期间关于Linux的一点微小的总结，大部分内容整理自互联网。不能再做梦了，还是要好好学习。 负载均衡Load balancing, 用来在多个计算机（计算机集群）、网络连接、CPU、磁盘驱动器或其他资源中分配负载，以达到最佳化资源使用、最大化吞吐率、最小化响应时间、同时避免过载的目的。使用带有负载平衡的多个服务器组件，取代单一的组件，可以通过冗余提高可靠性。负载平衡服务通常是由专用软件和硬件来完成。LBS入口 https://192.168.10.10/ 高可用性High availability, 指系统无中断地执行其功能的能力，代表系统的可用性程度。是进行系统设计时的准则之一。高可用性系统与构成该系统的各个组件相比可以更长时间运行。高可用性通常通过提高系统的容错能力来实现。定义一个系统怎样才算具有高可用性往往需要根据每一个案例的具体情况来具体分析。其度量方式，是根据系统损害、无法使用的时间，以及由无法运作回复到可运作状况的时间，与系统总运作时间的比较。 第一周任务书 HostOnly下网络的配置linux下的网络连接，ip地址在vmnet1的子网下。windows下vmnet1网卡的配置本地连接设置为共享 安装rz/sz先下载lrzsz-0.12.20.tar.gz包 #cd /tmp #tar zxvf lrzsz-0.12.20.tar.gz && cd lrzsz-0.12.20 指定安装目录 ./configure--prefix=/opt/lrzsz 没有指定安装目录 # ./configure && make && make install 上面安装过程默认把lsz和lrz安装到了/usr/local/bin/目录下, 下面创建软链接, 并命名为rz/sz: # cd /usr/bin # ln -s /usr/local/bin/lrz rz # ln -s /usr/local/bin/lsz sz 我自己指定的安装目录在/op/lrzsz这里，所以创建软连接如下 #cd /usr/bin #sudo ln -s /opt/lrzsz/bin/lrz rz #sudo ln -s /opt/lrzsz/bin/lsz sz 开启vsftpd[root@haohai ~]# chkconfig –list vsftpdvsftpd 0:关闭 1:关闭 2:关闭 3:关闭 4:关闭 5:关闭 6:关闭[root@haohai ~]# chkconfig –level 2345 vsftpd on[root@haohai ~]# chkconfig –list vsftpdvsftpd 0:关闭 1:关闭 2:启用 3:启用 4:启用 5:启用 6:关闭[root@haohai ~]# vi /etc/vsftpd/user_list[root@haohai ~]# vi /etc/vsftpd/ftpusers “Linux下安装vsftpd之后，默认的配置是匿名用户可以登录，匿名帐户有两个：用户名：anonymous密码：空用户名：ftp密码：ftp123456789101112131415161718192021[root@haohai ~]# cd /u01/soft/[root@haohai soft]# lsjdk-6u45-linux-i586-rpm.bin[root@haohai soft]# ./jdk-6u45-linux-i586-rpm.bin [root@haohai soft]# cd /usr[root@haohai usr]# lsbin games java lib libexec sbin srcetc include kerberos lib64 local share tmp[root@haohai usr]# cd java[root@haohai java]# lsdefault jdk1.6.0_45 latest[root@haohai java]# vi /etc/profileexport JAVA_HOME=/usr/java/jdk1.6.0_45export JRE_HOME=/usr/java/jdk1.6.0_45/jreexport PATH=$JAVA_HOME/bin:$JRE_HOME/bin:$PATHexport CLASSPATH=.:$JAVA_HOME/lib/dt.jar:$JAVA_HOME/lib/tools.jarexport PATH=$PATH:/sbin[root@haohai java]# source /etc/profile //不重启立即生效[root@haohai java]# java -versionjava version &quot;1.6.0_45&quot;Java(TM) SE Runtime Environment (build 1.6.0_45-b06) 防火墙配置顶顶顶 ps -ef |grep 输出的具体含义比如：12[root@localhost ~]# ps -ef | grep ApacheJetspeedroot 18887 18828 0 08:09 pts/0 00:00:00 grep ApacheJetspeed 字段含义如下：12UID PID PPID C STIME TTY TIME CMDroot 18887 18828 0 08:09 pts/0 00:00:00 grep ApacheJetspeed ps:将某个进程显示出来-A 显示所有程序。-e 此参数的效果和指定”A”参数相同。-f 显示UID,PPIP,C与STIME栏位。grep命令是查找中间的|是管道命令 是指ps命令与grep同时执行这条命令的意思是显示有关Apachejetspeed有关的进程UID PID PPID C STIME TTY TIME CMD各相关信息的意义：UID 程序被该 UID 所拥有PID 就是这个程序的 IDPPID 则是其上级父程序的IDC CPU 使用的资源百分比STIME 系统启动时间TTY 登入者的终端机位置TIME 使用掉的 CPU 时间CMD 所下达的指令为何对于查询结果，如何判断是运行与否呢？ 这是因为ps -ef是显示所有进程的消息，包括ApacheJetspeed和grep ApacheJetspeed这两个甚至包括ps -ef本身，而grep是查找输出包含想要的字符串的行，也就是说grep ApacheJetspeed是在所有运行的进程中查找输出包含“ApacheJetspeed”字符串的输出行，这里面就包含ApacheJetspeed，和grep ApacheJetspeed 两个进程。即，如果运行了会显示两条输出一条是ApacheJetspeed的，令一条是grep ApacheJetspeed的。如果没运行只会显示grep ApacheJetspeed的。 Linux系统下ssh登陆很慢的解决办法编辑sshd_config 这个文件：vi /etc/ssh/sshd_config。设置 USEDNS no CentOS7使用firewalld打开关闭防火墙与端口 1、firewalld的基本使用启动： systemctl start firewalld查看状态： systemctl status firewalld停止： systemctl disable firewalld禁用： systemctl stop firewalld 2.systemctl是CentOS7的服务管理工具中主要的工具，它融合之前service和chkconfig的功能于一体。123456789启动一个服务：systemctl start firewalld.service关闭一个服务：systemctl stop firewalld.service重启一个服务：systemctl restart firewalld.service显示一个服务的状态：systemctl status firewalld.service在开机时启用一个服务：systemctl enable firewalld.service在开机时禁用一个服务：systemctl disable firewalld.service查看服务是否开机启动：systemctl is-enabled firewalld.service查看已启动的服务列表：systemctl list-unit-files|grep enabled查看启动失败的服务列表：systemctl --failed 3.配置firewalld-cmd12345678910查看版本： firewall-cmd --version查看帮助： firewall-cmd --help显示状态： firewall-cmd --state查看所有打开的端口： firewall-cmd --zone=public --list-ports更新防火墙规则： firewall-cmd --reload查看区域信息: firewall-cmd --get-active-zones查看指定接口所属区域： firewall-cmd --get-zone-of-interface=eth0拒绝所有包：firewall-cmd --panic-on取消拒绝状态： firewall-cmd --panic-off查看是否拒绝： firewall-cmd --query-panic 那怎么开启一个端口呢添加firewall-cmd –zone=public –add-port=80/tcp –permanent （–permanent永久生效，没有此参数重启后失效）重新载入firewall-cmd –reload查看1firewall-cmd --zone= public --query-port=80/tcp 删除1firewall-cmd --zone= public --remove-port=80/tcp --permanent CENTOS 6.5 防火墙设置1vi /etc/sysconfig/iptables 注意点：新开放的端口一定要在端口22后面重启防火墙使配置生效1[root@localhost ~]# /etc/init.d/iptables restart 其它查看开放端口1[root@localhost ~]# /etc/init.d/iptables status 关闭防火墙1[root@localhost ~]# /etc/init.d/iptables stop","link":"/2017/01/11/Linux/"},{"title":"离北韩最近的地方——丹东","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;丹东，是抱着赴死的心态去探索完全陌生的朝鲜临行前对祖国的最后一瞥。▲一出火车站迎接我的就是毛主席的雕像，果然是见证革命友谊的城市。 ▲建的很高档的酒店，政治宣传的目的更明显一些。 ▲从丹东眺望朝鲜，朝鲜一侧是蓝天白云，丹东一侧却是霾蒙蒙的，不知道算不算是一种讽刺。 ▲江水被抽干，不知道是不是在清淤。 ▲在江边，眼睛里仿佛像看穿这世间一切的小女孩。 ▲都是友谊的象征。 ▲丹东版的柳京饭店，比朝鲜的还是差一些。 ▲山寨版的小七，在丹东还开了不少家。 ▲大红枣枸杞，在东北倒是见到了，在做大广赛的时候并没有体验过实物就开始打广告了。 ▲一辆辆朝鲜的巴士驶入中国国境，本来还惊叹于中朝之间的往来频繁，后来才知道都是返程的中国旅行团。 ▲对岸的一些景象，玻璃上的霓虹竟然是从对面映过来的。 ▲可以发光的竹蜻蜓，玩具是做的越来越高级了。 ▲丹东的韩餐，不知道是不是改良过的原因，还是比较符合中国人的口味的。 ▲朝鲜那边过来的人。 ▲朝鲜发放的临时签证。 ▲第二天的口岸正在修理，在此踏上朝鲜之旅。在我从朝鲜回来之后就火速修好了，路都翻新了一遍，国门形象真的被看的很重要。","link":"/2018/08/02/dandong/"},{"title":"Years Lapse Into Seconds 延时摄影","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;《分秒流年》的完成也有一段时间，同时申报了学校的创新项目，这周三就要答辩，于是要将2000字的小论文完成，顺便梳理一下大范围延时摄影的拍摄流程。 &emsp;&emsp;以下内容摘自论文,是我认为的论文的重点，也是在大范围延时摄影中比较值得注意的点。1234567（一）拍摄前期准备 在本次大范围移动延时摄影项目探究中，我们本着画质优先的原则，前期素材大部分采用图片拍摄的形式进行制作，此刻则需要一台相机与三角架以及辅助的标尺工具。 在部分场景中需要进行超大范围（数公里，本项目中为整个校园范围）的移动延时摄影，我们则采用手持稳定器进行辅助拍摄.（二）技术难点剖析 大范围移动延时摄影(Hyperlapse)的核心技术就是找寻一个参考点，并将其锁定在拍摄的每张照片的中心点。这样可以通过后期Adobe Premiere或是Adobe After Effects的稳定功能对画面的抖动进行修正。 在Adobe CC之后的版本中，Premiere与After Effects都提供了相应的插件可供使用。 当在每一次移动相机时，可以使用相同的参考点重新构图。每一次的移动要求等距以减少画面的错乱感，这样就需要在拍摄前期就找好相应的标尺工具，并测量出每个镜头的距离。 在很多时候我们可以借助很多现成的事物来帮我们确定距离，比如说地上一致大小的地砖，操场塑胶跑道上的凸起等等… 传统的延时摄影中，我们往往运用定时器对照片进行等时距拍摄，而在大范围移动延时摄影中，如果使用定时器，在移动过程中往往会手忙脚乱，造成一系列的失误。而在大范围移动延时摄影中，由于被拍摄的云朵等物体本身移动速度就并非匀速，而因对时间间隔的敏感度并不高，所以在这样的状况下我们只要专注于对构图以及距离间隔的调整。 在延时摄影中，拍摄者一般都会拍摄多余的帧画面进行冗余，而在视频倍率调整时会删除这些冗余的帧，然而，在大范围移动延时摄影拍摄中，往往会出现一些失误的情况，这时候直接进行抽帧操作，则有一定几率将拍摄失误的帧整合至正式的影片中。这时候我们需要手动对失误的帧进行调整，在《一個新奇畫面選取方法於動態縮時攝影影片建立之研究》[1]中，作者提供了坐标系进行程序化调整的方案，在后面的研究中可以进行进一步的探究，本次项目中我们仅采用了手动调整的方式。 &emsp;&emsp;《分秒流年》中还有很多想法都没有能够实现，希望能在将来的日子中可以去实践。&emsp;&emsp; 下面是正片，分别腾讯与Vimeo的链接，希望有能力（可以科学上网）的人可以去Vimeo看4K版本。 腾讯视频 Vimeo Years Lapse Into Seconds from HaoHai Wang on Vimeo.","link":"/2017/10/24/YearsLapseIntoSeconds/"},{"title":"东极之东：抚远","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;抚远，祖国真正的最东端，黑瞎子岛是祖国真正的东极岛。抚远之行从一开始就注定了不平凡，一路所见许多都是我前所未见的事物。 ▲抚远的故事还得从哈尔滨说起，看到的近在咫尺的火车站，看还有几个小时便在附近的商圈看了场电影，预留了1小时的时间去火车站。结果到了才发现南北广场是不通的，绕行要50分钟才能到，打车也没有人接单。无奈之下选择了乘坐小飞龙，结果还是没有能够赶上去抚远的火车。 ▲改签到了下一班车，哈站变成了哈东站，好在有地铁过去。排队的时候还是有座的，等排到的时候已经变成了无座，从软卧变成了无座，人生就是这么大起大落。 ▲那一夜的装备，买了小板凳，作为一个前20年没有坐过火车的苏北人，这一次算是把乘火车的酸甜苦辣一次尝尽了。 ▲烧炭的火车，似乎是烧开水用的，夏天嘛不用取暖，用来作为动力估计也不太现实。 ▲绥化站。 ▲第一次知道火车里是可以抽烟的。因为有个姑娘在这里，来抽烟的男人女人们少了很多。我用小板凳坐在这个姑娘旁边，也可以算是小半个室友了。 ▲不同角度来观看。 ▲火车上其他形形色色的人，若非这次误点，恐怕也没有机会来观察到这些景象吧。 ▲到了佳木斯已经是三点，很多人从这里下车，终于排队补上了硬卧的票，这时候已经可以看到天边的曙光。 ▲第一次体验火车卧铺，还是挺喜欢上铺的，睡的格外的香。 ▲醒来已经是9点多了，从窗外看到的是一片绿油油，和朝鲜的翠绿相比显然是有营养的多。 ▲中途奇奇怪怪的站名。 ▲中午十一点多终于再次踏上脚下的黑土地时，差点感动到要哭泣。 ▲旅店老板推荐的方向的餐馆，不过好像是找错了店，觉得不是很好吃。 ▲很多俄罗斯人过来购物。 ▲北面的黑龙江。 市政府。▲爬楼瘾又犯了。 ▲日暮景象 ▲星空 ▲早起去东极广场看日出，这才是祖国真正的最东端，舟山的东极岛不过沽名钓誉罢了，连浙江最东部的岛都不是。 ▲在我拍了一小段延时的时候，由于风大，师姐的小飞机不知道是掉到了乌苏里江里还是黑龙江里。在祖国的最东边每个人都发生了不太愉快的事情。 ▲在哨岗远眺东极广场。 ▲日光与月色的相遇。 ▲早晨。 ▲本来以为是在吃盒饭，结果是在。。。算了，只能放出一张虚焦的图。 ▲想到崇明和高美湿地。 ▲卖场营业员小姐姐是俄罗斯人。 ▲东极鱼市，见到各种奇奇怪怪的大鱼。 ▲硬核汉堡王。 ▲建筑废料，南方的建筑应该没有裹泡沫隔热。 ▲回去的路上没有再晚点，坐上了应该坐的车回去的。","link":"/2018/08/15/fuyuan/"},{"title":"师大的银杏叶","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;仿照上海交大南洋通讯社拍摄的一组师大的银杏叶，摄影创意的借鉴我不认为是一种可耻的事情，观念的发扬光大靠的便是不断的被发现与改造。以同样的手法也可以发现不同的美。","link":"/2018/10/25/ginkgo/"},{"title":"除夕夜的恒隆广场","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;除夕夜会有人逛街吗？闲来无事带着我的疑惑来到了崇安寺，选取恒隆作为样本进行了调查。▲晚上7点钟的恒隆，没有要关门的意思，想必是要正常营业。 ▲逛商场的人还不少，即便是在身边附近的都关闭的情况下，看来和我一样无聊的还不少。 ▲既然有人，商场还在开门，那想必还是有开着的店铺。一探究竟很有必要。B1的杂物社，木九十都关门了。 ▲丹尼尔惠灵顿和戴森也关门了。 ▲卖音响的，关门。 ▲奢侈品店有的看出是关门的，有的则是薛定谔的奢侈品店，灯开着看不到店员，无法确定是否开着。 ▲看看其他类别的店铺，本来也不存在的电影院，伴随着恒隆东塔的即将落成一并而来。 ▲再看看餐饮方面，网红奶茶KOI和喜茶关门。 ▲一系列都是关门的。 ▲跑到顶层，终于发现了尚未关门的俏江南。 ▲小辉哥也是歇业。 ▲新旺暂停营业，在开年会。 ▲西班牙牛排餐厅，也是大门敞开式的歇业。 ▲无锡本土的忆秦园和来自台湾的鼎泰丰都没有营业。 ▲台湾料理和越南料理没有营业。 ▲营业中的大渔铁板烧。 ▲被商场管理人员关闭了的一部分电梯，电梯门是敞开着的。 ▲橱窗外的烟花，东西隔壁市都全面禁燃禁放了，无锡却在这几天还要解禁，令人匪夷所思。 ▲理发店也关闭了。 ▲健身房除夕还在营业，然而我办卡的健身房早就休假了，羡慕嫉妒恨。 ▲同行友商，海马照相馆没有在营业。 ▲小米没有因为店铺开在苹果正上方而高一个level在除夕营业。 ▲和关门的Uniqlo相伴的吧台工作人员。 ▲逛完群楼出门，抬头看恒隆主楼，恒隆西塔都是办公楼，是没有酒店的，可以看出还是有一部分的人选择在除夕夜坚守在了岗位上。 总的来说，一部分餐饮和健身房选择了还在除夕夜的恒隆广场营业，餐饮业应该是看中年夜饭这一块的生意，而健身房应该是和客户有契约所在加之并不需要太多的人员坚守岗位还在营业。当然，恒隆之外，还有可爱的全家和罗森为这座城市提供着服务，在这个阖家团圆日子里坚守在自己的岗位上的所有人都是值得倾佩的。","link":"/2019/02/18/hanglung/"},{"title":"Hexo及icarus主题定制","text":"icarus个性定制配置修改的一些内容。为了防止Onedrive再把我的配置文件吞了或者还原成半年前的，把修改之处列出以绝后患。 增加文章字间距icarus中文显示字体有点挤。在icarus/source/css/style.styl中.article .content的部分加上letter-spacing: 0.04rem 将“阅读更多”直接跳转至文章页，而非#more断点/themes/icarus/layout/common/article.ejs:第68行删除#more1234566 &lt;div class=\"level-start\"&gt;67 &lt;div class=\"level-item\"&gt;68: &lt;a class=\"button is-size-7 is-light\" href=\"&lt;%- url_for(post.path) %&gt;#more\"&gt;&lt;%= __('article.more') %&gt;&lt;/a&gt;69 &lt;/div&gt;70 &lt;/div&gt; share.js插件屏蔽不用的分享图标/themes/icarus/layout/share/sharejs.ejs:中加入data-disabled或data-sites1&lt;div class=&quot;social-share&quot; data-disabled=&quot;tencent,linkedin,douban,diandian,google&quot;&gt;&lt;/div&gt; CSS修改在/themes/source/css/style.styl中进行修改 突出标题:1234.title border-left: #0085e2a1 6px solid margin-left: -1.5rem padding-left: 1rem 修正手机视图下标题比h1小的问题：(虽然不提倡直接用!important提高优先级,不过改动只有这几处改动，应该也不会翻车。)123456789101112131415@media screen and (max-width: screen-tablet - 1) .has-text-centered-mobile text-align: center !important .is-flex-center-mobile justify-content: center !important .has-mt-5-mobile margin-top: 1em !important .content h1 font-size: 1.25em !important h2 font-size: 1.2em !important .article .title font-weight: 430 !important 修改介绍栏关于我大小:123.button.is-rounded margin-left: 3em margin-right: 3em 参考:Jingjing’s Blog","link":"/2019/04/27/hexo-2/"},{"title":"Hexo Mac/Win10多平台同步","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;HEXO的迁移本来是一个很麻烦的事情，特别是node.js安装模块的文件很碎片化，以致传输效率很低下。另外的，我在不同地方使用不同的设备，对即时同步的需求很高。恰巧龙华给我们开通了OneDrive的教育版本，我尝试采用Onedrive进行云同步。 由于我的三台设备的环境均不同，分别是os x 10.14.4、os x 10.13.4和windows 10，在部署环境时则需要进行不同的配置。主要还是对node.js的配置，利用命令npm install即可配置。 配置完成后直接输入账号密码上传至github仓库即可，输入一次即可在本机记录，并不需要额外配置SSH。 在os x 10.13.4环境下进行上传操作时，遇到了qiniu插件无法读取本地文件的问题。 初步判断是权限问题，将管理员权限赋给文件夹后，并用sudo hexo s运行博客发现可以运转但是网页本地加载速度很慢，且依旧报错。 猜测是node.js的os x 10.13.4与os x 10.14.4配置文件共存出现的问题，打算下一步对os x 10.13.4系统进行升级。 Hexo的百度收录及Coding与Github同时部署博客未完待续","link":"/2019/04/20/hexo/"},{"title":"Mac系统下添加腾讯企业邮箱","text":"腾讯企业邮箱的官方文档感觉几百年没维护了,依照官方文档是登陆不上去的，Google了一下正确的登录方式。选择“其他”邮件账户，输入账号密码后会提示无法验证。 此刻填写收件服务器imap.exmail.qq.com，发件服务器smtp.exmail.qq.com。 在邮箱中获取客户端专用密码后即可登录。","link":"/2019/04/30/mac-tencent/"},{"title":"Oracle故障排除","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Oracle 11g数据库故障排除的记录本。 SP2-0618: Cannot find the Session Identifier123SQL&gt; set autotrace onSP2-0618: Cannot find the Session Identifier. Check PLUSTRACE role is enabledSP2-0611: Error enabling STATISTICS report 原因是该账户没有PLUSTRACE角色查看$ORACLE_HOME/sqlplus/admin的plustrce.sql发现如下内容： 1234567891011121314151617-- Copyright (c) Oracle Corporation 1995, 2002. All Rights Reserved.---- NAME-- plustrce.sql---- DESCRIPTION-- Creates a role with access to Dynamic Performance Tables-- for the SQL*Plus SET AUTOTRACE ... STATISTICS command.-- After this script has been run, each user requiring access to-- the AUTOTRACE feature should be granted the PLUSTRACE role by-- the DBA.---- USAGE-- sqlplus &quot;sys/knl_test7 as sysdba&quot; @plustrce---- Catalog.sql must have been run before this file is run.-- This file must be run while connected to a DBA schema. 以sysdba用户执行下列语句即可正常使用autotrace功能。 12345678set echo ondrop role plustrace;create role plustrace;grant select on v_$sesstat to plustrace;grant select on v_$statname to plustrace;grant select on v_$mystat to plustrace;grant plustrace to dba with admin option;set echo off SQLPLUS友善化输出set linesize 200：设置行宽，表示行宽被设置为200的字符column name format a40：设置列宽，设置name列为40个字符，a表示alphanumeric，字符的意思set pagesize 20：设置页面记录，设置每20行为一列 sqlplus命令是会话级的，exit之后就消失了。setlinesize 5000 exit之后作用就消失了 启动em时报错：OC4J Configuration issue修改hostname后报错：修改对应文件。版本升级后 1[oracle@192~ config]$ emca -config dbcontrol db sqlplus方向键问题12345678910[root@localhost ~]# rpm -ivh rlwrap-0.37-1.el5.i386.rpm[root@localhost ~]# su - grid[grid@localhost ~]$ vi .bash_profile [grid@localhost ~]$ source .bash_profile [grid@localhost ~]$ exitlogout[root@localhost ~]# su - oracle[oracle@localhost ~]$ vi .bash_profile [oracle@localhost ~]$ source .bash_profile 在.bash_profile 文件中加入了 alias sqlplus=&apos;rlwrap sqlplus&apos;","link":"/2015/01/07/oracle/"},{"title":"沪宁城际及京沪高铁沪宁段车站探究(上海篇)","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;上海，是中国最早拥有铁路的城市，本次调研报告的也选择用上海压轴。沪宁线上上海共有上海站、上海西站、南翔北站、安亭北站四个城际站以及上海虹桥站一个跨线站。由于沪宁城际和京沪既有线的存在，使得上海至江苏南部的铁路通达程度是优于至浙江的，从上海站、上海虹桥站、上海南站三大枢纽站均可便捷的抵达江苏南部的各大城市。上海站，位于现上海市静安区，在闸北静安并区前是属于闸北区的，所以近年来又被戏称为静安火车站。是距离上海市中心最近的车站。并没有关于上海老站的记忆，据网络资料现上海站是在原上海东站（麦根路货站）基础上建成的，以取代“老北站”（老沪宁铁路上海火车站）的存在。 上海站南广场，普速场所在地，由于是高架站房，普速场和城际场的区隔并不是十分明显。 上海地铁1号线上海站站，上海最老的地铁线路，略带有沧桑感。 上海站内沟通南北广场的社会通道，相较13年初至上海时并没有什么十足的变化，多了一些现代化的服务业品牌，不过已经是在此次探访中封店调整，整个地道的店铺都被关闭，期待将来这个区域的整体的焕然一新。 上海西站，看着听着都是个大站，也规划了3条地铁线路在此交汇。不过停靠列次却很少，一天只有17列车停靠。不过正是因为客流稀少，上海至上海西这一段的票源一般都是充足的，节假日买不到票去江苏方向可以祭出“上海到上海西”大法。 大概是越缺什么就越炫耀什么。 北广场其实是没有站前广场的，第一次见没有广场的广场。 安亭北站，线下站房的小站，一天有11列车停靠，相较而言算是一个比较优秀的成绩了。 南翔北站外的公交枢纽，嘉定公交与市区似乎是分开运营的。 拍不到全貌，站前广场的一块空地被围挡所区隔，应该是为了土拍而准备的。 普普通通的小站，一天有3列车的停靠并没有垫底，不过也快垫底了。 上海虹桥站，站房外竟然没有字。仔细想想我也是第一次来到这个地方，虹桥站的设计动线这一块本非让大量人聚集的地方。 虹桥站的字在铁轨上方，这就给地面机位去拍摄正面视角的虹桥站提出了挑战，除非在高架上开车或事利用无人机，几乎没有可能捕获到完全正面视角的上海虹桥站，即便是侧面，也是有着重重阻碍，很难拍摄出令人满意的照片。 倒是隔壁虹桥机场拍起来要容易很多，虹桥火车站和虹桥机场的字也很巧妙的列于一侧。机场、高铁、地铁以及CBD，“宇宙虹桥”之称名不虚传。","link":"/2019/02/27/railway-shanghai/"},{"title":"沪宁城际及京沪高铁沪宁段车站探究(南京篇)","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;在上一站丹徒耗费了太久的时间，给了我第一次以打车的方式来省城的机会，好在镇江的物价比较低，从句容宝华到栖霞仙林的的费用也就和在上海内环从西到东费用差不多。 第一站，仙林，离镇江最近的南京。仙林是我比较熟悉的一个区域，本科时期许多朋友们都在仙林的学校就读。近年来的大学城建设与地产开发也使得仙林区域聚齐的大量人口。 仙林站位于312国道附近，大学城和居住区近在咫尺。仙林站是所有尚在运营中的沪宁线小站中停靠列次最少的一个，一天仅有2班列车停靠，相较惠山站的地理位置与周遭的人口规模数量一天却有27班列车的停靠。仙林的这个数据实在是不是很好看，为了打造枢纽站而牺牲？周围的学生与居民的出行需求应该还是很旺盛的。 南京地铁金马路站站外，多年来的三轮车的问题依旧得不到解决，9102年了。 更惋惜的是不仅仅是在这样的郊区，在来到市中心的新街口又遭遇了与多年前一样的错愕，在东部强省省会的市中心竟然依旧存在非观光性质的三轮车，值得欣喜的是已经从人力的升级成了电动的。 紫金山东站，沪宁城际铁路中唯一个建而未用的车站，位于南京南站仙西联络线上，本用于沟通沪宁城际与南京南站，据说是因为成本问题才至今未开放，也是南京地铁2号线、4号线金马路站交汇之处。 车站被雪藏在了一片围挡之后。 在此开发的地产商们也很无奈，只能隐约的提到枢纽功能，也不说清是铁路枢纽还是地铁的枢纽，郊区两站换乘的地铁站恐怕称不上是枢纽站吧。 金马路站地铁站内的商业点，至今上海都市圈内外的商业模式还是有明显的分野的，曾经以为是出了上海皆如此。在走访东北各市之后发现即便是东三省这样在网络上已经被黑到没边的地方都鲜见如此传统的商业模式。省城的商业氛围似乎和正常的市场经济还有很远的距离，苏北各市的商业形态却也还不得不受到如此般的不良影响，苏北各市还是应该努力全面对接上海才是现代化建设的最捷径。 启程去市里的车站，不记得上一次来南京地铁里是不是暖色光源，低色温的光线对疲惫的路人还是很友好的，虽然看上去没有高色温光线那么高档，但是实用是最棒的。 地铁屏显是值得改进的，上海都市圈内的城市做的都比这个好。 南京站概况，从空中视角观察接入沪宁城际后的车站变迁。 南京站，股道比上海站还有多2股，几乎每一班过路的车辆都会停靠。不过站房还是侧式站房，以至于站房东西两侧被拉的很长，依靠28mm的镜头是无法捕捉全正面视角的南京站的。 从无到有变迁的南京南站。 南京南站和南京站设计的理念其实是相似的，以宏大的规模拦截过路车来形成枢纽站，南京南站的宏大即便是台湾友人也会惊叹到。 足够政治正确的车站外侧围挡，没有广角镜头切头切尾不够政治正确的我。","link":"/2019/02/22/railway-nanjing/"},{"title":"沪宁城际及京沪高铁沪宁段车站探究(苏州篇)","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;苏州作为沪宁线上巨无霸体量的存在，也理所当然的拥有了沿线最多的车站数量，在沪宁线上一共有7座车站。从望亭延绵至花桥的车站群。（本图片后期修改编辑自维基百科） 依旧是近水楼台先得拍，第一站来到了离无锡站最近的位于浒关的苏州新区站。新区站和普通的小站设计还是有点不一样的，像是普通小站加了个壳。 一天10次列车停靠，相较无锡新区站的30次每天的停靠列次，不算多，以至候车室也不是全天运营的。 加之周边密密麻麻的建成区，以及宜家、永旺的加持，停靠班次再密集一些比较合适。 人流稀少，甚至让我有足够时间来观察自己背包的安检影像。 这样的标志其实是在提醒人们这里有攀爬上去的机会。 苏州站，南北站房都焕然一新，同古城的定位相趋一致。不过在设计上地铁和高铁的换乘特别是地铁至高铁方向并没有做到十分便捷，最快捷的换乘通道需要有多次乘坐经验才能达成，否则只能绕行一大圈。 遗憾的是苏州站的书法字体已经没有了，甚至网上都鲜有史料，还是我花大功夫才收集到比较清晰的照片。老的车站连同民国至上世纪90年代的经济低沉一起被雪藏。 苏州站南广场站前广场，雕塑是范仲淹，并不是泰伯、阖闾或是伍子胥。 下一站，大闸蟹站，阳澄湖早已成了大闸蟹的代名词，站是普普通通的小站风貌。 比较特殊的是京沪高铁在站前广场经过，高铁列车呼啸而过，是相较其他车站的独特的体验。 阳澄湖已经是昆山的地界，国际昆的公交车都是和国际接轨的，大小屏显上都有英文的标注。 昆山南站，京沪高铁与沪宁城际在此交汇，因此具备了4台12线的二倍沿线地级市高铁车站的规模。 从这里花上17分钟便可以直达上海虹桥，24分钟可以直达上海站，通达程度无疑是高过沿线的沪宁城际、京沪高铁分离的地级市车站的。 站外的宣传标语。 一天仅停靠2次列车的花桥站，荒芜人烟，滴滴司机生怕是把我送错了地方，甚至在站厅旁出现了菜园。 完全线下式的站房，规模很小，不走近甚至是难以发现的。 同繁忙的上海地铁花桥站形成了鲜明的对比。 高铁苏州北站，同样的2台6线的规模。 站外的CBD很有未来感。 苏州北是沿线所有车站里站房面积最小的，差不多就是地铁站的规模，据传是因为当年没给铁道部钱。苏州的很多规划上都出现了极为短视的现象，反映在交通上最突出的便是高铁站和地铁1、2号线的规模。不过好在苏州北站有扩建的计划，未来站房面积要扩大十倍。 园区站，由于站前在修地铁，并不能拍到园区站的全貌，来了两次都尝试失败了，拥有广角镜头的重要性这时候就体现出来了。 从园区站看园区CBD，这应该是观景价值最高的车站之一了。","link":"/2019/02/26/railway-suzhou/"},{"title":"沪宁城际及京沪高铁沪宁段车站探究(无锡篇)","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;无锡从惠山开始说起。无锡的地名对于新无锡人来讲是很有意思的，锡山和惠山不在锡山区和惠山区而在梁溪区和滨湖区，天一中学在锡山区而天一地铁站却在惠山区，江苏省锡山中学不在锡山区而在惠山区等等诸种。而惠山、惠山区、惠山新城、惠山城铁站代指的均不是一个地方。此行的惠山站，在距离惠山和惠山新城均十公里左右的地方，去惠山古镇景区和惠山新城的朋友们请在无锡站下车。惠山站的设计和普通小站不太一样，顶棚的弧形设计使得雪景下的惠山站格外的不一样。 无锡拥有惠山和无锡新区两个小站，这两个小站的停靠列次均在沪宁线上均列在前三位，新区站还说得过去，并不是很明白惠山站这么偏僻的地方是什么地方的人会来乘车。 宏大而空旷的站前广场。 来乘车的人并不少，车站后侧还是一副农村景象。 经历了15年到16年的那次气候变化，上海周边城市的植被在冬天都有了亲妈式的穿法。 布局很早的酒店，惠山站规划会接入盐泰锡宜铁路成为一个枢纽站。 沪宁线所有新建站点中唯一一个用的不是电脑字体的站点。证明了新站也是可以用书法字体的，而事实则是绝大部分的新站都是电脑统一印刷的字体，令人不解，在这仅有的可以突破统一制式的空间绝大部分的站点却没有选择去突破。 又是下雪的一天，江南的雪这两年相较而言是特别多，拍摄时间和惠山站并不是同一天。 无锡站北广场，是沪宁城际场的所在处。车站设计借鉴了东京品川车站的设计理念，从外观上就可以看出他的不一样，车站四通八达，地铁、高铁、公交、出租的换乘都是十分便捷，基本上做到了零距离换乘。车站综合体本身也被赋予了一个比较日式的名字——无锡中央车站。 从候车厅眺望。比较遗憾的正是由于四通八达的特性，一部分旅客会从地铁站绕道车站综合体（图片左侧）来到候车厅，给人一种车站开在商场里的不好印象，进一步说明了车站导向标识有进一步人性化的空间。 城际场的无柱雨棚和普速场的矮雨棚形成了鲜明对比。 0站台和10站台负责停靠无锡始发通往上海的列车。普速场改造并没能改造成无柱雨棚据说有一理由是为了不挡住市区的高楼。 从城际场看无锡站南广场。 又过了很久。无锡站南广场，沪宁既有线普速场所在地，原本计划拆除重建并没有实现，仅仅执行了站房改造。在去年终于和北广场的高架候车室联通，也让从无锡站成为了从上海出发沪宁线上最后一座完整的高架车站。 无锡新区站，苏州车站拍完后傍晚从新区站下车。 新区站汇聚了大量了工厂厂房，附近只有一个正大的楼盘在建，被戏称为厂景房。亦同苏州新区周围成熟的建成区形成了鲜明了对比。 无锡新区外正在修建的无锡地铁三号线，规划通过3号线连通惠山站、无锡站、新区站三个沪宁城际站以及硕放机场。 一天30班次的密集停靠列次，让我拍摄完可以有合适时间的列车直接回到无锡站。 不同视角及焦距下的无锡东站。 2台6线的规模，无功无过，短期内也并没有拓建的计划，令人唏嘘。","link":"/2019/02/25/railway-wuxi/"},{"title":"沪宁城际及京沪高铁沪宁段车站探究(镇江篇)","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;镇江是除苏州外，仅有的沪宁线上拥有两个大站区间的市。沪锡常宁均只是中心城市在沪宁线上。共有六座车站，车站数量在沪宁线上位居第二，仅次于苏州。丹阳，著名的眼镜城，车站内外扑面而来的都是有关于眼镜。 新建的丹阳站南站房，造型给人一种难以言表的稚拙感（大概就是spittion的感觉吧！）。 审美情趣甚至不如老的站房来得好。 本来预留了半小时的时间给丹阳站，没想到丹阳站的规模之大超出我的想象，足足就9台11线，遗憾的是有些站台在这次改造中改为了花坛。 好在有不算远的社会通道可以直接穿越到北广场，在半小时内也完成了拍摄任务，有趣的是并未以火车站或是丹阳冠名，而是直接使用了眼镜城。 丹阳北也是沪宁线上京沪高铁除昆山外唯一经停的县级市。 侧式站房的候车室面积比苏州北地铁站般的空间着实大了许多。 两台四线的规模应该算是京沪高铁的最低配了，不过人流量看上去还可以。 镇江站的北站房也是新建的，丢掉了原有的康有为女弟子萧娴书写的书法字体，多少是会令人惋惜的。 雪中的镇江南站，找不到主人的小兔佩奇，整修中的站前广场。 在风雨中等了近2小时的公交没等到后叫的士来到了丹徒站，令人震惊的低物价让我后悔莫及，早知道就直接打车来了。 丹徒站，未来的镇江东站，关于这个车站有着一场腥风血雨的斗争。 南京市府对苏北铁路的打压是怎么洗也洗不干净的，在一个非沿线城市——南京参与了连镇铁路二次环评之后，连镇铁路过五峰山大桥之后就此强行拐了个180度大弯，俗称BY套。从原计划接入丹阳站改成了丹徒站，无砟变有砟（350时速变250），扬州南下苏南上海的时间足足增加了半个小时有余！ 自古以来，南京兴扬州衰，扬州兴南京衰，如今是相对而言南京极大兴扬州极大衰的今日扬州遭到打压也是实属正常，宁镇扬一体化不过是南柯一梦，为一己私利拆桥毁路的造孽行径终会有恶报的。 宝华山站，在一个很荒郊野岭的地方，一路很难找，压根没有人光顾，除了我。","link":"/2019/02/23/railway-zhenjiang/"},{"title":"沪宁城际及京沪高铁沪宁段车站探究(总结)","text":"&emsp;本次拍摄总结。&emsp;关于不同地点的总结可以单击超链接进入&emsp;南京篇&emsp;镇江篇&emsp;常州篇&emsp;无锡篇&emsp;苏州篇&emsp;上海篇 &emsp;&emsp;在确定拍摄计划到拍摄整理完成了花了很短的时间，在有限的时间里完成拍摄是赋予自我挑战的一种。这次实践活动最大的收获其实是亲身体验了相似的车站中蕴藏着的不同，即便是小的站点也会有不同的设计，避免了当年在台南高铁站和嘉义高铁站下车时的错愕情形，原因是这两个车站的设计是一模一样的。 &emsp;&emsp;至于拍摄本身是则是锦上添花，若是直接利用网络街景进行截取似乎可以更快也更好地完成整理工作。这种贝歇夫妇式的拍摄手法其实是老式过时的、在学院派内部政治正确的一种。在当下，这种的所谓的观念艺术，类型学的研究，拓扑学的纪实文本的实践手法，再多的美誉加持也不能够摆脱这样的手法已足以完全打包收录入历史的包袱中永久地封存起来的事实现况。 &emsp;&emsp;正如同相机按下快门捕捉到的永远是下一刻的影像那样，摄影是一门向前看而不是向后看的面向未来的学科。打开手机相册，相似的人物、地点已经由人工智能为我们自动归档，而影像资料借助网络上的城市街景、卫星拍摄结合人工智能的归档工具已经足以满足这样的社会学调查，摄影家其实不必要自我陶醉式地再饱含着十足的人文精神再去从不仅仅是贝歇夫妇式地以及其他政治正确的摄影实践。在大数据时代，由个人的摄影创作完成摄影文献功能的日子已经结束，摄影已经进入到摄影家应当参与管理归档标准制定的时代。很遗憾，我并没见到有哪一位摄影家有志于投身于新时代应有的摄影实践当中。 &emsp;&emsp;在拍摄与整理的过程中，利用了很多网络现有的影像和文字资料。在提前确认拍摄地点情况时利用了百度地图的街景功能，在收集车站详细资料时参考了12306的官方网站以及维基百科的相关词条，在整理航拍照片时截取了Google Earth中的历史材料。在收集资料时，最惊叹的是从航拍资料显示一些车站在重新修整过程中实现的逆袭式的规模成长，而从文字数据中则发现了看似设计差异不大的小型车站在通过列车数量上竟然有着巨大的差异。 &emsp;&emsp;在实际拍摄过程中，由于使用了一支广角端为28毫米的镜头，以至于在站前广场狭小甚至没有的情况下就对拍摄带来了一些困扰，在拍摄上海站北广场、上海站南广场、上海西站、南翔北站、苏州园区站、丹阳站南广场、南京站北广场时均利用了手工移轴、后期进行透视合成的手法进行拍摄，最终选取了上海站北广场、上海西站、南翔北站及丹阳站南广场的合成影像，由于第一次采用这样的手法进行拍摄实践，前期的一些操作不够严谨使得照片在合成后视角上出现了一些问题。上海站南广场和苏州园区则由于站前空间的更加有限，以至于素材无法应用于自动合成，上海站南广场采取了长焦拍摄来代替， 苏州园区站由于站前在修建地铁且有高架阻隔只能采用定点全景合成再进行透视修正以致画面的怪异感十分强烈，南京站北广场则由于合成后的图像比例与我本次设定的拍摄目标相差甚远也放弃了。上海虹桥站的标志并不在南北广场上方而是在铁轨上方与虹桥机场的标志方向一致，也对在地面拍摄车站正向视角的图片提出了一定的挑战。 &emsp;&emsp;最后，希望此次调研给诸位同仁能带来一些启发。","link":"/2019/02/28/railway/"},{"title":"在windows系统下批量文件重命名","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;mac系统下可以很方便的对一系列文件命名，windows系统自身却没有这样的功能，需要通过一些曲折的手段实现这样的功能。 在对旧版博客图片恢复时，从七牛云下载下的文件名中是包含中文的，为了避免日后的再次麻烦，需要对文件进行批量重新命名。 如何实现如上图从左到右的替换呢？需要利用到一些命令行的知识。利用win+R键调出运行，键入cmd.exe调出命令提示符工具。 然后进入到需要替换文件所在文件夹。 键入1dir/b&gt;allFileName.xls 会将所有文件名写入至excel文档中，打开后将第一行删除， 然后利用excel函数，对需要替换的部分进行替换。1=&quot;nostalgia&quot;&amp;MID(A1,3,9) 然后用如下公示生成bat命令 。1&quot;ren &quot;&amp;A1&amp;&quot; &quot;&amp;B1 在文件夹中新建一个txt，把C列复制到里面，改为*.bat： 双击运行即可大功告成。 参考来自【BAT】win7下对批量文件重命名（截取原始文件名中的部分作新名字）","link":"/2017/12/25/replace/"},{"title":"小猪与牡蛎","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;本是想做个这三年生活的忠实记录者，遗憾的是一路上艰辛不断，可以创作的空间被无情的压缩，希望能在有限的空间里继续更新下去。 ▲在林老师家时的场景 ▲吃猪排，我认识的吃过这个猪排的情侣都……不过好在这家店不久之后就倒闭了…… ▲在东三111会所 ▲在暗房 ▲在丽水 ▲打着灯笼也找不到的好汤圆 ▲朕给你打下的江山——被人一口吞了……","link":"/2017/12/25/rosewood/"},{"title":"黄昏 夕阳 姑娘","text":"黄昏 夕阳 姑娘转身后回眸处举手投足间潜藏的是 太多关于她的故事幸运的是 你 是否愿意侧耳倾听? 愈坚毅的外表下潜藏的往往是越难以控诉的心灵 灵魂总是徘徊于禁锢与禁锢之间 抬头仰望去找寻那个最接近天的地方 内心旁观者永远不会明白 纵情一跃的下一刻 能否落回心灵最初的的起点?","link":"/2016/11/04/sunset/"},{"title":"让三星港版机器微信原生支持运动计步","text":"&emsp;&emsp;三星的机器真的是鱼与熊掌不能兼得啊，要Google框架就没PAY，要国行特性就没Google框架。。。1//setkey &lt;deviceinfoconfig&gt;&lt;voip&gt;&lt;sensor&gt;&lt;stepCounterMaxStep5m&gt;1000&lt;/stepCounterMaxStep5m&gt; &lt;stepCounterSaveInterval&gt;60000&lt;/stepCounterSaveInterval&gt;&lt;stepCounterRateUs&gt;600000&lt;/stepCounterRateUs&gt; &lt;stepCounterSwitch&gt;1&lt;/stepCounterSwitch&gt;&lt;/sensor&gt;&lt;/voip&gt;&lt;/deviceinfoconfig&gt; 在微信任一聊天界面输入并发送以上代码。","link":"/2017/02/09/weixin/"},{"title":"火树银花触目红 揭天鼓吹闹春风","text":"火树银花触目红 揭天鼓吹闹春风百年那得更百年 今日还需爱今日赏灯那得工夫醉 未必明年此会同","link":"/2019/02/19/xiannvbang/"},{"title":"Firewall","text":"运维实习期间网络和防火墙有关知识的一点微小的总结. 关键词与概念LAN：局域网(Local Area Network)WAN：广域网 (Wide Area Network)WLAN：无线局域网(Wireless LAN)VLAN：虚拟局域网(Virtual Local Area Network)VPN：虚拟专用网络(Virtual Private Network)DNS：域名系统（Domain Name System）因特网上作为域名和IP地址相互映射的一个分布式数据库，能够使用户更方便的访问互联网，而不用去记住能够被机器直接读取的IP数串。通过主机名，最终得到该主机名对应的IP地址的过程叫做域名解析（或主机名解析）。DNS协议运行在UDP协议之上，使用端口号53。 华为防火墙：USR2130BSR FW Router 192.168.1.1 华为官方指南-GUI 华为官方指南-命令行Fortigate： https://203.148.48.84:4480/login 分层模型及其对应协议简表详表 第一层：物理层（PhysicalLayer)&emsp;&emsp;规定通信设备的机械的、电气的、功能的和过程的特性，用以建立、维护和拆除物理链路连接。具体地讲，机械 特性规定了网络连接时所需接插件的规格尺寸、引脚数量和排列情况等；电气特性规定了在物理连接上传输bit流时线路上信号电平的大小、阻抗匹配、传输速率 距离限制等；功能特性是指对各个信号先分配确切的信号含义，即定义了DTE和DCE之间各个线路的功能；规程特性定义了利用信号线进行bit流传输的一组 操作规程，是指在物理连接的建立、维护、交换信息是，DTE和DCE双放在各电路上的动作系列。在这一层，数据的单位称为比特（bit）。&emsp;&emsp;属于物理层定义的典型规范代表包括：EIA/TIA RS-232、EIA/TIA RS-449、V.35、RJ-45等。 第二层：数据链路层（DataLinkLayer)&emsp;&emsp;在物理层提供比特流服务的基础上，建立相邻结点之间的数据链路，通过差错控制提供数据帧（Frame）在信道上无差错的传输，并进行各电路上的动作系列。数据链路层在不可靠的物理介质上提供可靠的传输。该层的作用包括：物理地址寻址、数据的成帧、流量控制、数据的检错、重发等。在这一层，数据的单位称为帧（frame）。&emsp;&emsp;数据链路层协议的代表包括：SDLC、HDLC、PPP、STP、帧中继等。 第三层：网络层&emsp;&emsp;在计算机网络中进行通信的两个计算机之间可能会经过很多个数据链路，也可能还要经过很多通信子网。网络层的任务就是选择合适的网间路由和交换结点， 确保数据及时传送。网络层将数据链路层提供的帧组成数据包，包中封装有网络层包头，其中含有逻辑地址信息- -源站点和目的站点地址的网络地址。如 果你在谈论一个IP地址，那么你是在处理第3层的问题，这是“数据包”问题，而不是第2层的“帧”。IP是第3层问题的一部分，此外还有一些路由协议和地 址解析协议（ARP）。有关路由的一切事情都在这第3层处理。地址解析和路由是3层的重要目的。网络层还可以实现拥塞控制、网际互连等功能。在这一层，数据的单位称为数据包（packet）。&emsp;&emsp;网络层协议的代表包括：IP、IPX、RIP、OSPF等。 第四层：处理信息的传输层&emsp;&emsp;第4层的数据单元也称作数据包（packets）。但是，当你谈论TCP等具体的协议时又有特殊的叫法，TCP的数据单元称为段 （segments）而UDP协议的数据单元称为“数据报（datagrams）”。这个层负责获取全部信息，因此，它必须跟踪数据单元碎片、乱序到达的 数据包和其它在传输过程中可能发生的危险。第4层为上层提供端到端（最终用户到最终用户）的透明的、可靠的数据传输服务。所为透明的传输是指在通信过程中 传输层对上层屏蔽了通信传输系统的具体细节。&emsp;&emsp;传输层协议的代表包括：TCP、UDP、SPX等。 第五层：会话层&emsp;&emsp;这一层也可以称为会晤层或对话层，在会话层及以上的高层次中，数据传送的单位不再另外命名，而是统称为报文。会话层不参与具体的传输，它提供包括访问验证和会话管理在内的建立和维护应用之间通信的机制。如服务器验证用户登录便是由会话层完成的。 第六层：表示层&emsp;&emsp;这一层主要解决拥护信息的语法表示问题。它将欲交换的数据从适合于某一用户的抽象语法，转换为适合于OSI系统内部使用的传送语法。即提供格式化的表示和转换数据服务。数据的压缩和解压缩， 加密和解密等工作都由表示层负责。 第七层：应用层&emsp;&emsp;应用层为操作系统或网络应用程序提供访问网络服务的接口。应用层协议的代表包括：Telnet、FTP、HTTP、SNMP等。 开放式系统互联（OSI）模型与TCP/IP协议有什么区别？&emsp;&emsp;开放式系统互联模型是一个参考标准，解释协议相互之间应该如何相互作用。&emsp;&emsp;TCP/IP协议是美国国防部发明的，是让互联网成为了目前这个样子的标准之一。开放式系统互联模型中没有清楚地描绘TCP/IP协议，但是在解释TCP/IP协议时很容易想到开放式系统互联模型。两者的主要区别如下：&emsp;&emsp;TCP/IP协议中的应用层处理开放式系统互联模型中的第五层、第六层和第七层的功能。&emsp;&emsp;TCP/IP协议中的传输层并不能总是保证在传输层可靠地传输数据包，而开放式系统互联模型可以做到。TCP/IP协议还提供一项名为UDP（用户数据报协议）的选择。UDP不能保证可靠的数据包传输。 TCP/UDP协议&emsp;&emsp;TCP(Transmission Control Protocol)和UDP(User Datagram Protocol)协议属于传输层协议。其中TCP提供IP环境下的数据可靠传输，它提供的服务包括数据流传送、可靠性、有效流控、全双工操作和多路复用。通过面向连接、端到端和可靠的数据包发送。通俗说，它是事先为所发送的数据开辟出连接好的通道，然后再进行数据发送；而UDP则不为IP提供可靠性、流控或差错恢复功能。一般来说，TCP对应的是可靠性要求高的应用，而UDP对应的则是可靠性要求低、传输经济的应用。 &emsp;&emsp;TCP支持的应用协议主要有：Telnet、FTP、SMTP等；UDP支持的应用层协议主要有：NFS（网络文件系统）、SNMP（简单网络管理协议）、DNS（主域名称系统）、TFTP（通用文件传输协议）等。&emsp;&emsp;TCP/IP协议与低层的数据链路层和物理层无关，这也是TCP/IP的重要特点。&emsp;&emsp;OSI是Open System Interconnect的缩写，意为开放式系统互联。 传输层安全协议SSL/TLS一、作用不使用SSL/TLS的HTTP通信，就是不加密的通信。所有信息明文传播，带来了三大风险。（1） 窃听风险（eavesdropping）：第三方可以获知通信内容。（2） 篡改风险（tampering）：第三方可以修改通信内容。（3） 冒充风险（pretending）：第三方可以冒充他人身份参与通信。SSL/TLS协议是为了解决这三大风险而设计的，希望达到：（1） 所有信息都是加密传播，第三方无法窃听。（2） 具有校验机制，一旦被篡改，通信双方会立刻发现。（3） 配备身份证书，防止身份被冒充。互联网是开放环境，通信双方都是未知身份，这为协议的设计带来了很大的难度。而且，协议还必须能够经受所有匪夷所思的攻击，这使得SSL/TLS协议变得异常复杂。 二、历史互联网加密通信协议的历史，几乎与互联网一样长。1994年，NetScape公司设计了SSL协议（Secure Sockets Layer）的1.0版，但是未发布。1995年，NetScape公司发布SSL 2.0版，很快发现有严重漏洞。1996年，SSL 3.0版问世，得到大规模应用。1999年，互联网标准化组织ISOC接替NetScape公司，发布了SSL的升级版TLS 1.0版。2006年和2008年，TLS进行了两次升级，分别为TLS 1.1版和TLS 1.2版。最新的变动是2011年TLS 1.2的修订版。目前，应用最广泛的是TLS 1.0，接下来是SSL 3.0。但是，主流浏览器都已经实现了TLS 1.2的支持。TLS 1.0通常被标示为SSL 3.1，TLS 1.1为SSL 3.2，TLS 1.2为SSL 3.3。 三、基本的运行过程SSL/TLS协议的基本思路是采用公钥加密法，也就是说，客户端先向服务器端索要公钥，然后用公钥加密信息，服务器收到密文后，用自己的私钥解密。但是，这里有两个问题。（1）如何保证公钥不被篡改？解决方法：将公钥放在数字证书中。只要证书是可信的，公钥就是可信的。（2）公钥加密计算量太大，如何减少耗用的时间？解决方法：每一次对话（session），客户端和服务器端都生成一个”对话密钥”（session key），用它来加密信息。由于”对话密钥”是对称加密，所以运算速度非常快，而服务器公钥只用于加密”对话密钥”本身，这样就减少了加密运算的消耗时间。因此，SSL/TLS协议的基本过程是这样的：（1） 客户端向服务器端索要并验证公钥。（2） 双方协商生成”对话密钥”。（3） 双方采用”对话密钥”进行加密通信。上面过程的前两步，又称为”握手阶段”（handshake）。四、握手阶段的详细过程“握手阶段”涉及四次通信，我们一个个来看。需要注意的是，”握手阶段”的所有通信都是明文的。 4.1 客户端发出请求（ClientHello） 首先，客户端（通常是浏览器）先向服务器发出加密通信的请求，这被叫做ClientHello请求。 在这一步，客户端主要向服务器提供以下信息。 （1） 支持的协议版本，比如TLS 1.0版。（2） 一个客户端生成的随机数，稍后用于生成”对话密钥”。（3） 支持的加密方法，比如RSA公钥加密。（4） 支持的压缩方法。这里需要注意的是，客户端发送的信息之中不包括服务器的域名。也就是说，理论上服务器只能包含一个网站，否则会分不清应该向客户端提供哪一个网站的数字证书。这就是为什么通常一台服务器只能有一张数字证书的原因。 对于虚拟主机的用户来说，这当然很不方便。2006年，TLS协议加入了一个Server Name Indication扩展，允许客户端向服务器提供它所请求的域名。 4.2 服务器回应（SeverHello） 服务器收到客户端请求后，向客户端发出回应，这叫做SeverHello。服务器的回应包含以下内容。 （1） 确认使用的加密通信协议版本，比如TLS 1.0版本。如果浏览器与服务器支持的版本不一致，服务器关闭加密通信。（2） 一个服务器生成的随机数，稍后用于生成”对话密钥”。（3） 确认使用的加密方法，比如RSA公钥加密。（4） 服务器证书。除了上面这些信息，如果服务器需要确认客户端的身份，就会再包含一项请求，要求客户端提供”客户端证书”。比如，金融机构往往只允许认证客户连入自己的网络，就会向正式客户提供USB密钥，里面就包含了一张客户端证书。 4.3 客户端回应 客户端收到服务器回应以后，首先验证服务器证书。如果证书不是可信机构颁布、或者证书中的域名与实际域名不一致、或者证书已经过期，就会向访问者显示一个警告，由其选择是否还要继续通信。 如果证书没有问题，客户端就会从证书中取出服务器的公钥。然后，向服务器发送下面三项信息。 （1） 一个随机数。该随机数用服务器公钥加密，防止被窃听。（2） 编码改变通知，表示随后的信息都将用双方商定的加密方法和密钥发送。（3） 客户端握手结束通知，表示客户端的握手阶段已经结束。这一项同时也是前面发送的所有内容的hash值，用来供服务器校验。上面第一项的随机数，是整个握手阶段出现的第三个随机数，又称”pre-master key”。有了它以后，客户端和服务器就同时有了三个随机数，接着双方就用事先商定的加密方法，各自生成本次会话所用的同一把”会话密钥”。 至于为什么一定要用三个随机数，来生成”会话密钥”，dog250解释得很好： “不管是客户端还是服务器，都需要随机数，这样生成的密钥才不会每次都一样。由于SSL协议中证书是静态的，因此十分有必要引入一种随机因素来保证协商出来的密钥的随机性。对于RSA密钥交换算法来说，pre-master-key本身就是一个随机数，再加上hello消息中的随机，三个随机数通过一个密钥导出器最终导出一个对称密钥。pre master的存在在于SSL协议不信任每个主机都能产生完全随机的随机数，如果随机数不随机，那么pre master secret就有可能被猜出来，那么仅适用pre master secret作为密钥就不合适了，因此必须引入新的随机因素，那么客户端和服务器加上pre master secret三个随机数一同生成的密钥就不容易被猜出了，一个伪随机可能完全不随机，可是是三个伪随机就十分接近随机了，每增加一个自由度，随机性增加的可不是一。”此外，如果前一步，服务器要求客户端证书，客户端会在这一步发送证书及相关信息。 4.4 服务器的最后回应 服务器收到客户端的第三个随机数pre-master key之后，计算生成本次会话所用的”会话密钥”。然后，向客户端最后发送下面信息。 （1）编码改变通知，表示随后的信息都将用双方商定的加密方法和密钥发送。（2）服务器握手结束通知，表示服务器的握手阶段已经结束。这一项同时也是前面发送的所有内容的hash值，用来供客户端校验。至此，整个握手阶段全部结束。接下来，客户端与服务器进入加密通信，就完全是使用普通的HTTP协议，只不过用”会话密钥”加密内容。","link":"/2017/01/10/Firewall/"},{"title":"哈尔滨：冰城夏日","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;哈尔滨是师姐的家乡，也是此次东北行的最后一站。夏日的冰城没有那么浓转艳抹的等待游客的到来，反而流露出这个城市最真实的一面，增添了我对这个城市更深刻的理解。 老道外 ▲老道外的老建筑。 ▲老道外的窗。 ▲老道外的人与景。 ▲一些荒芜破落的景象。 ▲难以相信如今还有游戏机回收的行当。 ▲第一次现场观战菜鸡互啄。 ▲一街之隔的地方被称为中华巴洛克，尽是一些新建的建筑，不知道老道外现存的那些老建筑是否能逃脱掉被改造成这番模样的命运。 哈儿滨大剧院 ▲从傍晚到夜幕降临，大剧院的建筑美感展现的淋漓尽致，封面图1/3秒手持多张叠片也是用的如今手机超级夜景功能的原理。 松花江畔 ▲互怼现场，上次比较记忆犹新的还是在台湾的柱子上。 ▲年轻人喜欢的东西我已经看不懂了。 ▲减了5档曝光下的松花江也是挺有意思的。 ▲哈尔滨万达城，开业的比较早，无锡的19年底才能开业。 ▲一些夜景 中央大街 ▲只有在地人会关注时间的花车游行，若是我单独行动一定会错过演出。 教堂们 ▲穆斯林版圣索菲亚大教堂，冬天来的话是一定看不到这样的景象的。 ▲一些不够红的教堂，能还存留至今都是幸运的。 美食们 ▲道台府老厨家，锅包肉的创始店，锅包肉倒是没觉得有太好吃，反而另外两道菜十分惊艳。 ▲俄罗斯餐馆，的确算得上是一番新奇的体验，尤里这个名字玩过红色警戒的人一定都觉得看着很出戏。 ▲小布丁味马迭尔冰棍，在世界询问了更在地的人后才在店里面的角落买到了原味的正宗马迭尔冰棍。 城市的另一面 ▲从酒店往下俯瞰，出租车的比例相当的高，不知道是不是集体下班。 ▲火车站外的情形，停在到达层的一辆山寨小黄，哈尔滨这个气候很难发展共享单车。 ▲一台台小飞龙，很有可能就产自小飞龙之都江苏无锡。 ▲斯大林广场万达影城楼道里睡着的人。 ▲电影开始前的城市宣传广告。 ▲中央大街的时髦温度计。 ▲这个角度看有点尼泊尔的感觉。 ▲从新启用的宽阔大气的航站楼出发返回家乡，和远处的旧航站楼形成了鲜明的对比。 小总结东北之行圆满落幕，一路去了大连、沈阳、哈尔滨三座大城市，如果给一个定性的评分，那我觉得商业方面大连&gt;沈阳&gt;哈尔滨，地理位置的优劣扩大的对商人逐利行的描绘；要论洋气程度哈尔滨&gt;大连&gt;沈阳，不同文化交流的频繁给哈尔滨这座城市带来了不同于祖国其他城市的时髦感，也是地理位置上有失必有得的地方吧。","link":"/2018/08/15/harbin/"},{"title":"最陌生的福建：金门","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;金门岛，与厦门岛隔海相望。在行政上属于福建省泉州市，实际则是由台湾当局控制的，也是中华民国福建省政府的驻地。福建省府在上世纪末废省以来只是一个名存实亡的机构。&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;离开台湾岛已经三年有余，又由于曾经的一个flag不愿意回去本岛，于是便这样打了个擦边球来到金门以籍自己的思念之情。由于表妹一直想去厦门，二人一拍即合便有了这次厦金之行。&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;图片整理后被我分为五个部分以供阅读，分别是：金门的门、具有政治意涵的、田野调查、金门风光、在金门的人。 金门的门&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;金门的门可以说是形形色色，完全私有化的土地制度解放了人们的想象力，与对岸厦门千篇一律的高楼相比，加之未受到一些政治运动的波及，闽南文化反应在这些门上还是得到了很好的保留。▲这些门中有些门是住家户的，有些则是已被改造成民宿、旅游景点的门。 ▲很显然是人家的门，却都有了被废置的痕迹。 ▲金门酒厂。 ▲华侨之家，比较适合拍鬼片。 ▲金水国小的门。 ▲福建省政府的门。 具有政治意涵的 ▲名存实亡的福建省府，还没有金门县府热闹。 ▲庆祝双十的金门县府。 ▲DPP在金门的装备，很显然是没有什么市场的。 ▲反观豪华配置的KMT党部。 ▲毛主席特调的销路比蒋公特调好的多得多，在自家土地上还如此待遇真的是令人唏嘘。 ▲如此多的蒋公铜像也仅仅能在离岛这样的空间中生存下去。 ▲来自民众的一些具备政治意向的物件。 ▲和大陆有着些似有似无联系的物件。 ▲国军的坦克和飞机。 ▲国军的募兵宣传。 ▲把近代的人在庙里这么供着真的是第一次见。 ▲邓丽君向大陆人民喊话的地方。 田野调查 ▲整个自由地区都是的物价都让人觉得匪夷所思，冠绝全球发达经济体的PPP指数体现在即同样品牌的生活物资绝大数都是要比大陆便宜的，特别是奶茶，近年来大陆涌现出太多骗中产阶级钱的奶茶，同样的制作手法差价有的高达两到三倍。 ▲很难界定哪一个社会形态下中国人更西化。 ▲辛苦的东亚民族。 ▲一个长得很全家的公共厕所。 金门风光 在金门的人 ▲我妹装装嫩还行，我就显然一幅老头像了。 ▲年轻时的马英九，很帅。 ▲毒品、性、生死……这些我们整个教育体系都不会触碰的事情在这片土地上却早早让小孩子接触了解，也不知道是好是坏。 ▲来自本岛的旅行团。 ▲狗在看看狗的人，猫在吃人吃的东西。","link":"/2018/10/24/kinmen/"},{"title":"在韩国的游与学","text":"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;时隔小半年再次踏上半岛的土地，却是从三八线的这边到了线的那边。&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;参加了学校的短期游学项目，和去朝鲜一样是跟团游，是近年来的第二回。因为是学校的活动，所以巧或不巧地认识了新的小伙伴，也可算作是缘分了。本来是一个班抑或是一个学院的同学彼此间却很不熟悉，通过这样的一个活动能够结实新的好朋友也是很开心的。&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;以游为主，以学为辅是这次活动的特色，因此照片也以时间为轴，以“游”为主，“学”则是贯穿在了整个“游”之中的。▲头一回不是乘地铁到浦东机场到，一大清早看到并行的地铁二号线还是很兴奋的。 ▲一踏入这片土地便遇见了首尔的雪。 ▲夜店风的大巴车，虽然看着不是很豪华，但是有地暖，是很热的。 ▲第一次吃到这么简配的石锅拌饭，本团的餐食配置要比朝鲜的团差了太多个数量级。 ▲和新认识的朋友们，刚刚踏上韩国的土地，彼此之间还不是很熟悉。 ▲新朋友和老朋友，由于我的原因有了这么一次短暂的相遇。 ▲行程几日的暂居之处，梨泰院，记得去年在这里吃过烤肉，已经记不清是哪一家了。 ▲熟悉的明洞区域，住过半个月的地方，再次踏入久别重逢的喜悦之感油然而生。 ▲喜欢镜子倒影中的朋友们。 ▲和发小的短暂相聚，弥补了上次的遗憾。在地人挑的烤肉店，比明洞那家要好吃不少。 ▲头一次体验了韩国的公交车。 ▲第一次吃这么小粒的冰淇淋，信用卡用不了还请来了欧巴帮忙。 ▲自己卷的泡菜。 ▲泡菜馆对面的YG大楼，比较后现代工业风。 ▲第一次在白天来夜店大。 ▲夜店大附近的人，韩式羽绒服的正确用法；勤劳的劳动人民；中文的小广告；注意口腔护理的阿加西。 ▲依旧是喜欢倒影中的朋友们。 ▲最爱的炸鸡。 ▲从南山公园看首尔。 ▲希望我也可以一直保有对喜欢的人的喜爱之心和对于生活的好奇心。 ▲从南山下来便到了忠武路，熟悉的路口、熟悉的楼和熟悉的咖啡店，一切都很熟悉，因此选择脱团静静的喝一杯咖啡。 ▲问了导游才知道这是卖牛奶的。 ▲在火车和汽车间的运动，很好的利用了公共空间，最后一天在汉江边上我们也实践了。 ▲台湾黑熊。 ▲几乎没有壁画的壁画村。 ▲广藏市场里的活章鱼，没有勇气去尝试。 ▲地铁里的人性化设施。 ▲梨泰院附近。 ▲游学，真的很短暂。 ▲后面的小姑娘真的很会抢戏。 ▲第一次夜游梨大。 ▲最后一天，在汉江边上，难忘的蓝天，难忘的朋友们。 ▲来机场免税店提货区提货，本来还打算体验一下去年签单的爽快感，没想到已经由电子签名所替代，签一次就可以。愈加程式化的世界，很多东西都变得越来越乏味了。 ▲再次从这个目前去过最多回的机场和韩国说再见。","link":"/2018/12/07/korea-2018/"},{"title":"我们的2017  我们的故事","text":"春风澹荡 麦浪翻云桐叶知秋 残冬蜡月四季轮回 一年又至新的一年新的故事与您分享哈尔滨上海上海交响乐团DisneylandSaipan首尔华山重庆西安校园淮安CardiffLondonBarcelonaBathNiceParisPernath2017 既有快乐 也有痛苦 既有满足 也有遗憾 不过终将离我们远去 2018 期待再次与你相遇","link":"/2017/12/31/life-2017/"},{"title":"谈笑风生又一年","text":"&emsp;&emsp;春风澹荡；麦浪翻云；桐叶知秋；残冬蜡月；四季轮回；&emsp;&emsp;谈笑风生又一年。 乡愁 &emsp;&emsp;▲教会我“秧针刺水，麦浪翻云。”这个词的是在龙华山脚下的便当店里偶遇的老爷爷。在我陆续回答我是大陆人—江苏人—淮安人之后还问我是淮阴人还是老淮安人的一个老爷爷。这个已经被太多本地人淡忘的观念在异国他家被人提及是令人震惊的。 &emsp;&emsp;那一餐吃了很久。机缘下，他选择坐在了我的对面。从大陆沦陷跟随国府迁台聊到年轻时的境遇，从家庭观人生观聊到教导我要孝顺忠诚，从古文观止聊到学习已经学历的重要性。老人是扬州江都人，半个月前老伴的驾鹤西去让这位年满九十的外省老人在我这个“老乡”面前释放了太多了的感情，孤独感是我从老人身上感受到最多的。 &emsp;&emsp;在我起身离去后，我不再想再去打扰这位老人，只留下了这张孤独的背景。那个已在台一学期即将离开的我，与这位老人是感同身受的。那时在想，整个中华民族是不是都缺少自我反省的态度？在不断对人民渲染外族入侵惨烈的同时，当权者们是否有自省过内战、内斗对整个民族造成的伤痛才是最深重的？在这一点上两岸所经历的悲剧是共同的。 &emsp;&emsp;▲对家乡的描绘是少的。在家里的时候，妈妈问我为什么不见我去拍照，我总是说家里没什么可以拍的。在学生年代，执着于都市的摩天大楼，摄影观念停及在对唯美风光的追求。只当在自己失去太多可以呆在家乡的时间后才追悔莫及。 &emsp;&emsp;▲印象中小时候的家乡是一成不变的，高中后的快速变化让我找不回他原本的样子了。 &emsp;&emsp;▲扬州，在其代管的偏安一隅的县城度过了高中三年，除了初一的一次记忆不深的学校春游，市区则是第一次自已前往。扬州的样子的，是一去就让人喜欢的样子，其实这就是我心中淮安的样子啊， 同样是运河上的古城，扬州人把扬州按着扬州的样子建设着，而淮安人还在怀疑自己是不是淮安人。 &emsp;&emsp;▲淮左、淮东、淮南。在淮河流域繁盛的时候，都以与“淮”沾边而为荣，而在如今的淮河流域更多的恐怕的只是穷的代名词了。 &emsp;&emsp;▲在虹口能吃上这样的一桌乡意浓厚的饭，是令人喜悦的。 &emsp;&emsp;▲国庆期间还去了趟邻市盐城，大丰麋鹿园，5A级景区，江苏省市市有，整个江苏省的发展都是令人欣喜的。 风光&emsp;&emsp;“剑阁天下雄，夔门天下险，峨眉天下雄，青城天下幽。”气象万千的风光是震撼人心且喜闻乐见的，也是我近年来表现最多的题材。 &emsp;&emsp;▲2015年的最后一天，四个月内第八次登顶台北的四兽山。十多小时的等待，我在对都市风光的极度着迷中迎来了2016年的第一天。 &emsp;&emsp;▲学期末，以第三次去淡水，第二次西线环岛游来告别在台湾的交流生活，整个大学生活最快乐的一段时光。 &emsp;&emsp;▲台中、台南、高雄都是去了好几次的城市，虽然与台北的熟悉不能比，但也不算是个匆匆的游客。 &emsp;&emsp;▲在香港则是个十足的过客。 &emsp;&emsp;▲上海，已生活了三年的地方，说要比家乡还熟悉的多毫不为过，发达的市内交通系统带来太多的便利。 &emsp;&emsp;▲故事还要从这里说起，风景摄影的深入探究其实是从这里遇到的事和人的巧合下开始了。 &emsp;&emsp;▲两工大，哪个楼顶我没去过？! &emsp;&emsp;▲青岛，一个很喜欢的城市，各方面苏省也是顶尖的，城建可以比拟江苏最棒的南京，城市幸福感可与江苏最好的苏州、无锡比肩。与2015年去过的济南留下的印象反差很大，很疑惑作为省会的济南为何与青岛的差距那么大。感谢在台湾相识的朋友们的招待。 镜像这个章节很有趣，很多似是而非的镜像都会在此出现。 &emsp;&emsp;▲在街巷里偶遇的工程车，本来只是对车上的假人感兴趣，后来发现右下角的工人与柯市长神似。 &emsp;&emsp;▲在台湾时用了两次高铁三日券，加之台湾高铁有自由座这个选项（直接上车不用预订），高铁的搭乘和地铁一样快捷，虽说不是每个站都下过，但也是每个站都到过，我还记得嘉义站同下一站的展厅设计是一模一样的，我在下车时真的怀疑是下错了站。 &emsp;&emsp;▲一月份的时候去过的一些车站。 &emsp;&emsp;▲在台湾最后的那段时光各种际遇而致的思乡之情格外浓重，纵使我羡慕自由中国，欣赏台湾这片土地，但台湾终究不是我的家。&emsp;&emsp;那段时间正值蔡主席刚刚当选，又发生了令人错愕的大陆小粉红屠版新总统脸书的事件，而台湾媒体找到的“帝吧”,然而此“帝吧”真的不是彼帝吧（李毅吧），太多的误解就是因为这样的相互不了解！ &emsp;&emsp;▲在台中偶遇的好友开的店(误)。 &emsp;&emsp;▲一年内经历了两岸的两次选举，PRC的全国及地方最高权利机关人民代表大会也是一层层投票选上去的，只不过至今为止人大的实权还是没有落实，所以只是名义上的最高权利机关。个人观点，在纯政治生活这一块，ROC的选举其实也并未高明在何处，政治权利上民主的恐怕也只是选举那一天，在生产力条件相仿的情况下政治制度终究不会有太大的差异的。 &emsp;&emsp;▲之前组织的光绘活动拉了电视台两位同仁先行测试，三个人画出来的三个不着边际的词展示了他们不同的关注点。 &emsp;&emsp;▲你不知道你这一秒正谈笑风生的地方在下一秒会有怎样的命运，虽然这是一个需要快速适应变化的时代，但是我还是很不是喜欢改变，知道电视台被搞掉了的那一刻起内心的悲伤持续了好久，再一次相遇已是物似人非，一片狼藉。 &emsp;&emsp;▲家中正翻新中的院子，十几年看惯的院子，就在这一刻被改变，我怕会太快忘记它曾经的样子，赶紧拿起相机，记录下它的样子。 &emsp;&emsp;▲2016年的上海风景摄影之旅可谓是从看星星开始到看星星结束。","link":"/2016/12/31/life-2016/"},{"title":"我们的2018  我们的故事","text":"春风澹荡 麦浪翻云桐叶知秋 残冬蜡月虽已沧海桑田 依旧乘风破浪虽已尘埃落定 依旧炙热欢畅▲昊美术馆 ▲英国 ▲葡萄牙 ▲金门 ▲东极之东：抚远 ▲哈尔滨 ▲朝鲜半岛 新的一年目明心亮立心力行 新的一年期待再次与你相遇","link":"/2019/01/31/life-2018-cmw/"},{"title":"四海承风送骏犬 八方辐辏迎天蓬","text":"四海承风送骏犬 八方辐辏迎天蓬两两相对 六道轮回不经意间人生的两轮已经逝去第二轮的最后一年 同样有着很多故事精彩也好 遗憾也罢 都已逝去新的一年 新的一轮目明心亮 立心力行在经历尝试过一些事情之后，我们会发现真的是人各有命，不是所有东西都适合，都能喜欢。 这一年与SSO的缘分还依旧，甚至还出现了一些意想不到的小插曲。 也第一次作为观众与好友在SSO观赏演出。 和台湾朋友新年的相互寄信从已经成了一个传统。2017-20182018-2019 胶卷的冲洗，一套流程其实并没有什么太值得探究的地方，只要熟练之后几乎不会有失误，并不适合用一学期去学期它。 离别总是忧伤的，不知道与家乡的作别到底是不是一个正确的决定，只有等时间告诉我们答案。 收拾行装时整理出来的物品，永久免费升级的优化大师已经早在互联网时代的洪流中不见了踪影。只是想赚你钱的厂家的虚伪承诺罢了，哪有什么永远呢？ 乘大巴路过宝应，生活过三年的地方，还是有很多回忆的。同时再度感慨江苏省这样一个号称中等发达国家水平的省份的铁路建设竟然如此落后。 来无锡看的第一个小区，河埒口的紫金伴山，之前爬楼来过这个小区，完全人车分流的小区，可惜离高架太近，且由于学区的关系价格偏高就放弃了。 江苏公务员考试划水，报了省直单位的缘故，考点设在了苏州，早上乘高铁到苏州考的试。 挑选新家的过程中也是一路心酸，和万科还弄的不是很愉快。后来敲定的长泰的房子考虑的时间不够充足，还是有些遗憾之处，不过也为我将来自己买房积累了经验。 参与了校研会的一些拍摄活动，虽然不是很主动，有些拍摄现在回想起来还是有点意思的。 文苑印象的拍摄，一言难尽的一个夜晚。 在锡的一个地产商的活动，台湾摄影届赫赫有名的阮义忠先生竟然会过来站台，摄影师的身份地位的确认在这个时代已经堕落到了如此的地步吗？ 回校看话剧，马导的social能力比我要强100倍，帮忙安排的第一排座位。 不敢相信台上都是一群工科、计算机相关专业的学生，当年的我的同学以及我怎么没有他们一半开朗大方？后生可畏。 给童导和她的室友拍毕业照。作别了童导，上师大只有新人，没有故人。 裸妆者广告比赛在江大，作为在地人，招待了一番聂同学一行，顺便又见了一面即将毕业的台湾小学弟。比赛样品都被我带回去了，拿回来的洗衣液还没有用完。 以及后来的大广赛，合作的还算愉快，谁能想到在年底会出了岔子。 和无锡的缘分可以说是源自social queen没有单，没有蛋我也不会这么多次的来到无锡，微信里江大的同学是超过我本身自己呆的学校。在台认识了一群同学中小一届的还有另外一个姑娘，帮这一届同学拍完毕业照之后江南大学也没有了故人，连新人都没有了。 不记得什么原因穿拖鞋来淮海路了，还拍了一张，现在觉得很有趣。 邀我妹来无锡玩，表情依旧的很丰富。 从东三贫民窟的一楼阴面搬到二楼阳面，确定好宿舍位置后的尚未入住前的偷偷一瞥。 周老师的展，策展人是林老师，林老师吐槽周老师给女同学都写了一堆话给男同学则是寥寥数字，林老师和周老师的关系隐隐感觉是挺塑料的。 蓝晒印像工艺，第二学期的三个传统工艺之一，是相较而言我最感兴趣的一个摄影工艺。 本科室友的录取通知书，让我代领的，被我P掉他的名字之后骗过人。 蠡湖边上的螳螂捕蝉,黄雀在后。 这一年里唯一一本完全看完的书籍，值得纪念。 接着的暑假旅行去了东北和朝鲜，一路的所见所感已经在游记中说过，在此也不再赘述了。点击蓝色超链接可以跳转至相关游记。《旅顺大连市》 《离北韩最近的地方——丹东》 《清之杭州：龙兴之地——沈阳》 《哈尔滨：冰城夏日》 淮安机场，已经是暑期旅行归来，回淮安参加奶奶的70大寿。 顺便走访了未曾去过的郎静山故居，不是转行学摄影，谁能知道被誉为中国摄影第一人的人竟然来自淮阴。 太湖十八弯，有山有水有古迹，还有有强有力的市中心商业繁荣，无锡在我看来是上海都市圈里最宜居的城市。 月饼的拍摄，文苑印象有史以来投入最大的一辑制作。 上海赛车场，头一次去看赛车，顺便帮老刘戴了顶鲜艳的帽子（XDD 误）。 AI大会的拍摄，很感谢这一年来给我介绍活儿的各种小伙伴。 后来去了厦门和金门，在金门玩的很愉快，在厦门却不是特别愉快，甚至没有用相机拍摄一张照片，由于不是很愉快还对妹妹态度还不是很好，也是我做哥哥一直觉得很愧疚的一点。《最陌生的福建：金门》 今年的最后去了韩国，短期的游学生活结实了新的朋友，还在改变着我的整个生活，还未到是该总结的时候。一些关于旅行的感想也已经在游记《在韩国的游与学》中已经展现。","link":"/2019/02/03/life-2018/"},{"title":"《清算风光摄影》系列文章","text":"林路老师的“清算”系文章，复习一下，为了写作做准备。 《清算风光摄影》&emsp;&emsp;说起风光摄影，尤其是具有唯美色彩的风光作品，是中国摄影界最为热衷的题材之一。然而，风光摄影在现代摄影的领域，在中西方的不同大环境中，却呈现出不同的境遇，留下许多足可玩味的思考空间。手上有一套法国权威机构出品的光盘《摄影的精彩历程》，两张DVD，270多分钟，包罗了1700张照片和300位摄影家的传奇经历，其涉及面之广，有肖像摄影、时尚摄影、人体摄影、战争摄影、报道摄影以及超现实主义摄影、摄影与科学、摄影市场甚至包括独立的业余摄影爱好者一章，时间跨度历经一个半世纪的摄影史，但是唯独不见风光摄影，令我的一位风光摄影发烧友借去后大呼上当。这决不是一种偶然。 &emsp;&emsp;其实在整个西方摄影界的范畴，纯粹的唯美的风光摄影早已不在摄影史的法眼之中，我们一向崇敬的大师级人物安塞尔·亚当斯被罗森布卢姆的《世界摄影史》放在了现代主义摄影的章节中。而在这本权威的摄影史著作中，风景摄影或是出现在早期的纪实摄影范畴，或是出现在后期的科学探索的行列，唯独没有被列入艺术摄影的领域。甚至会让更多人大跌眼镜的是，在顾铮的《世界摄影史》中，亚当斯根本没有进入他的视野。我们所熟悉的风光摄影最多只能在书中早期的“地理空间的摄影确认”以及后期的“新地形摄影”中找到可怜的蛛丝马迹。我们必须清醒地看到，作为文化层面的风景，应该是具有更高层次的社会认同价值。或者从地理学的角度展现人对自然的思考，或者以人文的目光重新审视风景的意义。如果你仔细读过斯蒂芬·肖尔、乔尔·斯滕菲尔德、罗伯特·亚当斯等摄影家的“新彩色摄影”、“新地形摄影”作品，就会发现面对人文的和自然的风光会有很多的开拓空间。而一般意义上纯唯美的风景描述，早已失去了思考层面的价值——与中国摄影界对风光摄影的热衷（或者说是狂热）形成鲜明的对照。 &emsp;&emsp;比如作为新彩色摄影的代表人物之一的乔尔·斯滕菲尔德早在世纪80年代，就以其《美国景观》通过图像对传统的风景摄影进行了全新的诠释。当时，斯滕菲尔德以都市街头摄影获得古根海姆奖金之后，他决定聚焦于更广泛的艺术范畴，从而驱使他超越都市街头摄影的局限，走向人文地理的广袤空间。 &emsp;&emsp;他的实践也受到一些新地理学摄影师的影响，如罗伯特·亚当斯、列维斯·巴尔兹等，整个拍摄过程和拍摄对象保持一种冷漠的距离感，简化画面的构成，并且将目光聚焦于郊区的发展和工业园区。他的景观印证了美国人的一种渴望，他们想生活在一个想象中的天堂，而非真实的世界。然而他的思考方式，在中国摄影界却几乎无人涉及。 &emsp;&emsp;这里不是说不要风光摄影，而是说我们并不需要这么多从唯美的意义上对风光的描述，面对同一个风景成群结队的三脚架上的照相机在同一个角度疯狂扫射，说得严重一点，耗费的是整个民族的精气，得来的却是毫无现实价值的唯美碎片。甚至从某种意义上说，还会因此造成对许许多多原本纯净美丽的自然状态的损害，造成无可挽回的人文与自然的破坏。 &emsp;&emsp;有这样一个例子：迈克尔·迪维克在很久以前就发现了一个美丽的地方——蒙托克，距离曼哈顿100英里却少为人知。那里风光美丽，世风纯净，几乎没有人锁上他们的门，炸玉米饼的小贩还可以赊账。就是这样一个渔乡小镇，一直在抵抗外来世界的“入侵”，避免成为另一个汉普顿，另一个火烧岛。迪维克知道蒙托克更好的一面，海岸并不拥挤，夏日也不喧嚣，路边仅仅只有两家汽车旅馆。他在那里拍摄了大量的照片，但是秘不示人。他很早就想出一本画册，但是他说“如果这本画册加速了这样的生活方式的消逝，我宁可放慢自己的脚步”。这样他一直等待了28年时间，看到蒙托克已经无法抗拒地成为旅游宣传的热点之后，才在2004年出版了一本名为《结束》的精美画册，成为对过去美好时光的一段回忆，一曲绝唱。 &emsp;&emsp;我甚至还在怀疑，一些大规模的偏远地区的风光摄影组织活动，比如近日的“中外摄影家看西藏”拍摄活动，究竟是利大于弊还是弊大于利？且不说拍摄活动所带来的蜻蜓点水的浮光掠影，很可能会对风光摄影的创作带来严重的误导。更重要的是这样的大规模拍摄对于一个自然区域的保护，是真的符合现代化的进程，还是从某种意义上加速了人类家园的终结？其实在大多数西方国家，甚至一些现代化进程比较发达的东方国家如日本等，对于这样的风光摄影的视觉开发是十分谨慎的，相反那些有责任的摄影家倒是更注重对环境保护的意识。身边有一本刚到手的美国《光圈》杂志，这是一本品位很高的艺术摄影杂志，但是其中所推出的一个专辑令人惊心：《清除—切断》。这是美国著名摄影家罗伯特·亚当斯的黑白影像系列，展现了美国西北部90%以上原始森林曾经被肆意砍伐的现状。他通过大画幅相机以非常细腻的影像揭示了这一触目惊心的事实，并且在文字中提出了一连串的质问。试想在中国摄影界，会有哪一本纯艺术的摄影杂志会以这样的方式推出如此让人心颤的风光摄影作品？ &emsp;&emsp;中国的风光摄影，是应该到了认真“清算”的紧要关头了。 让百家争鸣进入机制建设&emsp;&emsp;有人诟病摄影艺术圈缺乏文化素养，缺乏包容气度。确实，凭借高科技的发展，摄影器材自动化的程度越来越高，摄影的入门变得轻而易举，摄影已经成为一种普及化的无意识娱乐行为。向来自居于艺术象牙塔顶端的摄影人或难以直面如此“泛滥”的摄影潮，引发的直接影响是变得浮躁，更容易满足于表面的视觉认同，放弃了对人类精神层面的探索。摄影界有没有能力和勇气应对这种变化，在海量的摄影群体中卓尔不群，为有思想、有创见的摄影家营造一个更令人舒心的创作环境？或者在容忍普通消费性审美欣赏的同时，更多地将摄影这样一个“大图像”的概念指向更为广泛的批判性的领域，从而真正以参与者的身份进入文化空间，再造摄影真正的辉煌？要知道，离开了健全的批评机制，摄影人文精神的培养只能是空中楼阁。 &emsp;&emsp;但在当下，摄影评论机制的发育并不健全，难见有见地、说真话的高质量摄影评论。其症结主要表现在两个方面，一是缺乏有容乃大、海纳百川的环境基础。举个例子，2006年年初我的一篇《“清算”——风光摄影》刊载在《中国摄影家》杂志的卷首，引起了轩然大波,“清算”一词招来众多非议。摄影评论本来就是评论者对某项事物、某种现象的一管之见，非议并非不能容；但关键是读者要读懂批评文章，知其意、点其疑。然而当时很多人并没有读懂我的文章，对这一观点产生了误读。其实我说的对风光摄影的“清算”，不是不要风光摄影，而是需要对当前的风光摄影进行“深入研究”，“使其不断发展”。我反复强调的是，我们并不需要这么多从唯美的意义上对风光的描述，成群结队的摄影家对同一个风景在同一个角度疯狂扫射，这种现象说得严重一点，耗费的是整个民族的精气，得来的却是毫无现实价值的碎片。甚至从环保理念看，还会造成对自然和人文环境的破坏。 &emsp;&emsp;这虽然是个例，从中也可看出当下摄影评论难以兼容不同观点声音的现状。在文化素养本来就薄弱的摄影界，我们更需要多元化，不同角度、不同深度的评论，只有经过反复的磨砺和实践，才能提升摄影家的文化素养，推动摄影艺术的发展。 &emsp;&emsp;症结的第二方面是体制的约束。摄影家、评论家多为体制外人士，语境和视点或与体制内有所不同，其观点见解难免失之“规范”。但一些摄影媒体对此并不宽容，往往对指出圈内弊端的评论封杀，让批评者失去发表见解的平台和机会。如此，便没有人再敢说真话、写实话了，形成了摄影批评的一大怪相。 &emsp;&emsp;笔者建议市文联办一份倾听各种声音、发表各种意见的内部刊物，相信是有百利而无一害的。中国摄影发展到今天，成就斐然，但也存在妨碍突破和发展的瓶颈性问题，市文联可以通过这样一个平台，成为疏通不同评论的声音的通道。（作者系上海市摄影家协会副主席） “清算”风光、评判“唯美”及其他&emsp;&emsp;对风光摄影的“清算”，不是不要风光摄影，而正是需要对当前中国的风光摄影进行“深入研究”，“使其不断发展”。至于对“清算”风光摄影所已经造成的一些误读，则是需要花一些笔墨加以澄清的。 &emsp;&emsp;我在《自然精神》一书中曾经这样写过：我们每一个人面对自然风景，或多或少都会产生一种冲动。自然的风景一旦转换成诗人笔下的千古佳句，或是画家纸上的不朽丹青，甚至是摄影家镜头下或苍然悲壮、或清新秀丽的画面，总是一次次人与自然对话的过程。此时的风景也许不再是凡夫俗子眼中的那一道风光，而是一种人化的自然。每个人心中都应该有一片因社会经历、因生活磨练、因审美情趣而不同的风景，一旦和自然的风景形成某种对应，也许就能激发出奇特的能量。于是我们跋山涉水，于是我们越洋过海，不时地在寻找着什么，不时地在感悟着什么，终于会在一次海边的日出，或是在山中的一次日暮，我们惊喜地叫出声来——找到了隐密在心灵深处的某种秘密瞬间，一刹那外化成难以言说的感动。好在有了摄影，有了在感动之间按下的快门，于是我们又一次通过照片看到了一片内心的风景——这一片风景是否也会如期的感动我们呢？ &emsp;&emsp;如今我想说的是，对风光摄影的“清算”，不是不要风光摄影，而正是需要对当前中国的风光摄影进行“深入研究”，“使其不断发展”。至于对“清算”风光摄影所已经造成的一些误读，则是需要花一些笔墨加以澄清的。“清算”风光摄影的终极目的，在于对中国风光摄影畸形发展的“高烧不退”注入清凉剂，希望更多的人对风光摄影有一个更为客观的认识，不要将太多的精力耗费于最终的失落之间。大规模的、“集团性”的对一个风景点的“狂轰滥炸”，已经成为当下风光摄影的一种“痼疾”。其实每一位摄影者都应该静下心来想一想，成群扎堆地拍摄风光究竟是否适合自己、适合自己所身处的时代？当年亚当斯的f/64小组也就那么几个成员，即便一起外出也不会蔚为壮观。更何况如今我们奉为神明的那些顶尖之作，大多是亚当斯独自一人带着沉重的摄影器材，跋涉于荒山野岭之间的艰难成果。只有认认真真走自己的路，拍摄那些真正感动自己的风景，才可能最终感动他人。一窝蜂跟在别人后面，或者让人一窝蜂地跟在后面，充其量制造的只是商家们所乐于看到的经济效应，而非真正的艺术结晶。多少年前的“文化搭台、经济唱戏”，如今在摄影界已经具体演变成“摄影搭台、经济唱戏”。那些吸引无数摄影者为求一巨奖而举办的风光摄影大赛，得益者正是地方的开发者和商家。一旦利益在手，他们或许就会抽身而去，留下的恰恰是对自然的“毁灭性”的灾难。尤其是我国现在的自然保护法还远不健全，最近引起轩然大波的怒江水电开发事件，就是一个极好的证明。数十年前因亚当斯以及其他一些摄影家的摄影作品所带来的对美国国家森林公园的开发和保护，在当代急功近利的中国社会环境中，远只是镜花水月而已，这点千万不能掉以轻心，也希望组织者不要贪图一己之利，形成误导。 &emsp;&emsp;我从来就没有说过不要风光摄影，只是希望中国的风光摄影能够走上一个更为健康的轨道。也许最低的要求，就是希望一窝蜂去拍摄风光的摄影人中，会有一些明智者“全身而退”，少耗费一些无谓的财力和精力，选择更适合自己拍摄题材和表现能力的空间。比如可以拍摄自己身边的凡人小事，记录日新月异都市发展进程中可能失落的历史痕迹，让中国摄影走上更为全面多样化的发展轨道。放在世界的大环境中，中国摄影的薄弱点在哪里，明眼人一看便知，不需在这里多加篇幅论述了吧！如果心甘情愿地将今日中国摄影的定位等同于1958年（将近50年前）的美国《大众摄影》水准，我也无话可说了。至于亚当斯的作品是否属于传统的风光摄影的范畴，这点可以讨论（后面还有论及），但是这些作品的拍卖价格，在当今拍卖市场也只是处于中等水准，更何况能有几幅纯唯美的风光摄影能够进入今日拍卖市场的“重锤”之下？ &emsp;&emsp;接下来就是“唯美”的话题，和风光摄影有关，却不仅仅限于风光摄影。 &emsp;&emsp;我很同意李少白先生的观点：“唯美”是一种境界，一种很高很高的境界，一种难以达到的境界。即便是从低层次上说，正如我的前一篇文章中所论及的，中国摄影一以贯之的“唯美”摄影空间对于推动全民族的摄影创作热情来说，对于摄影器材的普及和推销来说，无疑是利大于弊的。但是应该引起我们重视的是，当今中国摄影界缺乏思想深度的唯美的轨迹，导向的不是摄影的高层次，而是浅层次的无意识徘徊，结果反而距离“难以达到的境界”更远，甚至是南辕北辙。 &emsp;&emsp;尤其是我并不同意这样的推断：摄影的高级形态＝艺术，艺术的本质＝唯美。由此得出的结论：摄影的本质＝唯美。其实无论从哪一个角度理解摄影，摄影本质的命脉乃至最高级的形态恰恰不是“唯美”，而是“纪实”，这是从摄影一诞生就早已界定的。无数批评家就摄影史的发展早已为这一特征做出了为世人所公认的结论，并且已经成为常识——从罗兰·巴特到苏姗·桑塔格，这里无须一一细数。即便是亚当斯，他的作品也无法用“唯美”来衡量。当年以亚当斯等人为核心卓然独立的f/64小组绝不是什么唯美主义的摄影团体，而是一个追求摄影终极目标——客观纪实的团体。这些以“纯影派”或者“直接摄影”命名的创造者，试图通过照相机的物理和化学功能精确地展现自然尽可能多的细节魅力，从而传递他们对自然的敬畏之情。即便是在今天，还会有谁会用“唯美”来评述他们的作品？ &emsp;&emsp;因此，追求摄影“唯美”的境界没有错，但是将“唯美”作为摄影唯一的最高的指向也就有失偏颇。说得难听一点，中国摄影大部分沙龙的和唯美的摄影导向在某种意义上无疑是一剂思想的鸦片（在风光摄影中尤甚），它只会在更大的程度上窒息摄影的灵魂，而不是单单靠一点表面的繁荣和漂亮可以来拯救摄影者的。也正如我在以前的文章中所说：其实说白了，即便是诗意或美只不过是一种笼统的构建，在诗意或美的背后依然是各不相同的价值观、人生观等与现实密切相关的“政治性”的东西。中国摄影界有没有能力和勇气完全推翻长久以来的审美教育思想，全力来营造一个更令人舒心的创作环境？或者至少在容忍应有的消费性的审美欣赏的同时，更多地将摄影这样一个“大图像”的概念指向更为广泛的批判性的领域，从而真正以参与者的身份进入文化的空间，再造摄影真正的辉煌？ &emsp;&emsp;最后还想说的是，中国的风光摄影应该“清算”，无原则一味追求唯美的倾向也应该“清算”。清算的目的不是不要风光摄影，不是不要唯美，而是希望给中国摄影以更为多样化的、更为健康的生长环境。","link":"/2019/04/18/qingsuan/"},{"title":"利用CycleGAN进行人工智能艺术创作","text":"CycleGAN是GAN在艺术创作领域应用的进一步实践。对CycleGAN进行部署和改造以实现人工智能语境下的艺术创作。 在Centos下部署CycleGAN环境centos内置的python是2.7版本，利用yum安装python3.6，yum install python36安装pip yum install python36-pip安装git yum install git安装visdompip3 install visdom安装dominatepip3 install dominate在mac下上传训练集至服务器scp /local/file user@remote:/file /local/file 是本地文件 后面部分［用户名］@［ip地址:］［服务器中的文件目录］ 安装lua12345$ wget http://www.lua.org/ftp/lua-5.1.5.tar.gz $ tar zxvf lua-5.1.5.tar.gz $ cd lua-5.1.5 $ make linux $ make install 解决安装lua时报错“致命错误：readline/readline.h：没有那个文件或目录”： yum install -y readline-devel 安装PyTorch1pip3 install torch torchvision 执行CycleGAN--gpu_ids -1是仅使用CPU进行运算，由于没有nvidia显卡只能用CPU了，速度上会慢很多。12python3 -m visdom.serverpython3 train.py --dataroot ./datasets/monet2photo --name maps_monet --model cycle_gan --gpu_ids -1 visdom.server则是深度学习可视化的工具，在浏览器中通过访问8097端口可以观察学习进展，http://localhost:8097翻车……服务器内存太小，一会会就溢出了，部署至实验室电脑。 在Mac os下部署CycleGAN环境仅仅是包管理器不一样，和linux中的步骤基本上是一致的。有的时候因为网络的原因，会导致包的缺失需要再次安装。brew install python3pip3 install visdompip3 install dominatepip3 install torch torchvision解决无法import PyTorch brew install libomp执行CycleGAN的命令是同上的 运行环境 大概一天能够运行1轮，设定的学习目标是200轮。。。大概还是需要nvidia显卡进行人工智能学习了，而苹果最新的系统又封杀了cuda，简直就是自绝于深度学习大门之外。","link":"/2019/05/04/cyclegan/"},{"title":"Photogram 物影摄影：小猪佩奇","text":"物影摄影是暗房中运用光将物体阴影直接投射到相纸上的一种技巧。英文名称是Photogram，在台湾又被译作是黑影照片，是一种无相机的艺术创作。这种技巧原本是运用于科学研究中对植物结构的记录，后来被艺术家使用成为一种艺术创作的媒介。至于物影到底算不算作是摄影，我的理解是只要是对光线的捕捉并且能够表达一定观念的固定影像都算作是摄影，并不取决于是否利用相机进行捕捉。 产生一张物影照片的过程：空间中具备可发散的光源（1）直接照射在一张感光纸前面的物体上（2和3）；调整物体与纸张的距离，它们的阴影看起来更硬朗（7）或更柔和（5）。物体下方影子位置（6）的纸张区域保持白色; 如果物体是透明或半透明的，它们会变成灰色; 完全暴露在光线下的区域（4）则会变黑。（转译自维基百科） 《小猪佩奇》系列则是利用了一些生活废物与中间片联合在暗房中构成的。其中要特别感谢给牡蛎班长给小猪创作的泳衣、冲浪板、冰淇淋、气球等一系列道具。","link":"/2019/05/15/photogram/"}],"tags":[{"name":"Linux","slug":"Linux","link":"/tags/Linux/"},{"name":"计算机","slug":"计算机","link":"/tags/计算机/"},{"name":"东北","slug":"东北","link":"/tags/东北/"},{"name":"旅行","slug":"旅行","link":"/tags/旅行/"},{"name":"二工大","slug":"二工大","link":"/tags/二工大/"},{"name":"延时摄影","slug":"延时摄影","link":"/tags/延时摄影/"},{"name":"上海师大","slug":"上海师大","link":"/tags/上海师大/"},{"name":"无锡","slug":"无锡","link":"/tags/无锡/"},{"name":"hexo","slug":"hexo","link":"/tags/hexo/"},{"name":"icarus","slug":"icarus","link":"/tags/icarus/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Oracle","slug":"Oracle","link":"/tags/Oracle/"},{"name":"铁路","slug":"铁路","link":"/tags/铁路/"},{"name":"上海","slug":"上海","link":"/tags/上海/"},{"name":"南京","slug":"南京","link":"/tags/南京/"},{"name":"苏州","slug":"苏州","link":"/tags/苏州/"},{"name":"镇江","slug":"镇江","link":"/tags/镇江/"},{"name":"摄影班","slug":"摄影班","link":"/tags/摄影班/"},{"name":"写真","slug":"写真","link":"/tags/写真/"},{"name":"手机","slug":"手机","link":"/tags/手机/"},{"name":"Firewall","slug":"Firewall","link":"/tags/Firewall/"},{"name":"金门","slug":"金门","link":"/tags/金门/"},{"name":"半岛","slug":"半岛","link":"/tags/半岛/"},{"name":"摄影","slug":"摄影","link":"/tags/摄影/"},{"name":"批评","slug":"批评","link":"/tags/批评/"},{"name":"艺术创作","slug":"艺术创作","link":"/tags/艺术创作/"},{"name":"人工智能","slug":"人工智能","link":"/tags/人工智能/"},{"name":"暗房","slug":"暗房","link":"/tags/暗房/"}],"categories":[{"name":"Wiki","slug":"Wiki","link":"/categories/Wiki/"},{"name":"摄影","slug":"摄影","link":"/categories/摄影/"},{"name":"专题","slug":"摄影/专题","link":"/categories/摄影/专题/"},{"name":"游记","slug":"摄影/游记","link":"/categories/摄影/游记/"},{"name":"学术","slug":"学术","link":"/categories/学术/"},{"name":"文献","slug":"学术/文献","link":"/categories/学术/文献/"},{"name":"人工智能","slug":"学术/人工智能","link":"/categories/学术/人工智能/"}]}